{
    "url": "https://docs.gocobalt.io/api-reference/config/update-config",
    "text": "Update Config - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Config Update Config Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples About API Reference Overview Linked Account GET Get linked account by ID GET Get all linked accounts POST Create linked account PUT Upsert linked account DEL Delete linked account Applications GET Get all applications GET Get application by Slug PUT Migrate Token for a Linked Account Config POST Upsert Config PUT Update Config GET Get All Installed Configs GET Get Config by ID DEL Delete Config Config Fields POST Get All Config Fields Datastores GET Get all Config Datastores GET List Records in Datastore POST Search Datastore Records Event POST Trigger an event POST Trigger an event for single app Webhooks POST Create Webhook PUT Update Webhook GET Get all webhooks GET Get webhook by ID DEL Delete webhook POST (Deprecated) Subscribe to events POST (Deprecated) Unsubscribe from an event Executions GET Get execution by ID GET Get all executions Session Token POST Generate Token for Linked Account Cobalt Hosted POST Create Hosted URL GET Get hosted properties Config Update Config PUT / api / v2 / public / config This API updates the config for an application. ​ Request description ​ Headers ​ linked_account_id string required Unique customer identification id. For Eg: markwood@some_email.com ​ Body Parameters ​ slug string required Application slug. Eg: hubspot ​ config_id string A unique id for the config. If not provided, linked_account_id is considered as the config_id by default. ​ fields object Global input fields of the app described by slug Show Example properties ​ 649ade09c7b80fc6f0a3d1bc object This is an example field id of a map field. Below example shows mapping of the fields with user defined variables. Dynamic Mapping of hubspot fields to user defined variables \"649ade09c7b80fc6f0a3d1bc\" : { \"amount\" : \"amount_in_home_currency\" , \"close_span\" : \"days_to_close\" } Show example properties ​ amount string Example of user defined variable. Mapping it to a hubspot field amount_in_home_currency ​ close_span string Example of user defined variable. Mapping it to a hubspot field days_to_close ​ 64abea6d941ba774d124b19c string Static field value allocation. \"64abea6d941ba774d124b19c\" : \"default\" ​ workflows array required Published worflows of the app. Show child attributes ​ id string required Workflow id ​ enabled boolean required Enable/disable workflow ​ fields object Workflow specific input fields. Show Example properties ​ 649ade09c7b80fc6f0a3d1bc object This is an example field id of a map field. Below example shows mapping of the fields with user defined variables. Dynamic Mapping of hubspot fields to user defined variables \"649ade09c7b80fc6f0a3d1bc\" : { \"amount\" : \"amount_in_home_currency\" , \"close_span\" : \"days_to_close\" } Show example properties ​ amount string Example of user defined variable. Mapping it to a hubspot field amount_in_home_currency ​ close_span string Example of user defined variable. Mapping it to a hubspot field days_to_close ​ 64abea6d941ba774d124b19c string Static field value allocation. \"64abea6d941ba774d124b19c\" : \"default\" ​ Response description 200 Error ​ slug string Application slug ​ config_id string Unique ID of the created config ​ fields array Global input fields of an application Show properties ​ id string Unique field id ​ name string Field display name ​ field_type string Field input type. Expected values: text , number , select , map ​ options array Options array for the select field, or map field. Show properties ​ name string Display name ​ value string Value ​ required boolean If the field is a required field. ​ labels array Dynamic fields for user to map data to the map options. Show properties ​ name string Display name ​ value string Value ​ workflows array Published workflows of the application Show properties ​ id string Workflow ID ​ name string Workflow name ​ description string Workflow description ​ enabled boolean If the workflow is enabled for the linked account ​ fields array Workflow specific input fields Show properties ​ id string Unique field id ​ name string Field display name ​ field_type string Field input type. Expected values: text , number , select , map ​ options array Options array for the select field, or map field. Show properties ​ name string Display name ​ value string Value ​ required boolean If the field is a required field. ​ labels array Dynamic fields for user to map data to the map options. Show properties ​ name string Display name ​ value string Value Upsert Config Get All Installed Configs linkedin twitter Powered by Mintlify"
}