{
    "url": "https://docs.gocobalt.io/api-reference/cobalt-connect/get-connect-url",
    "text": "Create Hosted URL - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Cobalt Hosted Create Hosted URL Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples About API Reference Overview Linked Account GET Get linked account by ID GET Get all linked accounts POST Create linked account PUT Upsert linked account DEL Delete linked account Applications GET Get all applications GET Get application by Slug PUT Migrate Token for a Linked Account Config POST Upsert Config PUT Update Config GET Get All Installed Configs GET Get Config by ID DEL Delete Config Config Fields POST Get All Config Fields Datastores GET Get all Config Datastores GET List Records in Datastore POST Search Datastore Records Event POST Trigger an event POST Trigger an event for single app Webhooks POST Create Webhook PUT Update Webhook GET Get all webhooks GET Get webhook by ID DEL Delete webhook POST (Deprecated) Subscribe to events POST (Deprecated) Unsubscribe from an event Executions GET Get execution by ID GET Get all executions Session Token POST Generate Token for Linked Account Cobalt Hosted POST Create Hosted URL GET Get hosted properties Cobalt Hosted Create Hosted URL POST / api / v2 / public / connect-url Returns the connection URL in format: https://connect.gocobalt.io/{TOKEN} ​ Request description ​ Headers ​ Authorization string Unlike other API’s in this documentation. This API requires the session token as a bearer token. Please ommit the x-api-key from the header of this API. Header for Generate Connect URL API Authorization: Bearer { SESSION TOKEN } ​ Query Parameters ​ config_id string Config ID to be used for creating Hosted URL If the config_id is not found, then a new config will be created using the config_id. ​ Body Parameters ​ color string Text Colour Hex ​ bgColor string Background Colour Hex ​ name string Customer name ​ Response description 200 400 ​ hosted_url string Hosted Auth-Flow URL Generate Token for Linked Account Get hosted properties linkedin twitter Powered by Mintlify"
}