{
    "url": "https://docs.gocobalt.io/api-reference/customer/get-linked-account",
    "text": "Get linked account by ID - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Linked Account Get linked account by ID Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples About API Reference Overview Linked Account GET Get linked account by ID GET Get all linked accounts POST Create linked account PUT Upsert linked account DEL Delete linked account Applications GET Get all applications GET Get application by Slug PUT Migrate Token for a Linked Account Config POST Upsert Config PUT Update Config GET Get All Installed Configs GET Get Config by ID DEL Delete Config Config Fields POST Get All Config Fields Datastores GET Get all Config Datastores GET List Records in Datastore POST Search Datastore Records Event POST Trigger an event POST Trigger an event for single app Webhooks POST Create Webhook PUT Update Webhook GET Get all webhooks GET Get webhook by ID DEL Delete webhook POST (Deprecated) Subscribe to events POST (Deprecated) Unsubscribe from an event Executions GET Get execution by ID GET Get all executions Session Token POST Generate Token for Linked Account Cobalt Hosted POST Create Hosted URL GET Get hosted properties Linked Account Get linked account by ID GET / api / v2 / public / linked-account / :linked_account_id This API retrieves information about a specific linked account by using its unique identifier. ​ Request description ​ Path Parameters ​ linked_account_id string required Unique customer identification id. For Eg: markwood@some_email.com ​ Response description 200 400 ​ _id string index id of the record created ​ associated_org string Organization Id ​ account_id string Linked account id ​ environment string Environment in which the account was created ​ name string Name of the linked account ​ udf array Initial values passed while creating the linked account. User can pass any values of primitive datatypes. ​ createdAt date Creation time ​ updatedAt date `Last update time ​ __v integer Overview Get all linked accounts linkedin twitter Powered by Mintlify"
}