{
    "url": "https://docs.gocobalt.io/api-reference/integration-meta/list-applications",
    "text": "Get all applications - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Applications Get all applications Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples About API Reference Overview Linked Account GET Get linked account by ID GET Get all linked accounts POST Create linked account PUT Upsert linked account DEL Delete linked account Applications GET Get all applications GET Get application by Slug PUT Migrate Token for a Linked Account Config POST Upsert Config PUT Update Config GET Get All Installed Configs GET Get Config by ID DEL Delete Config Config Fields POST Get All Config Fields Datastores GET Get all Config Datastores GET List Records in Datastore POST Search Datastore Records Event POST Trigger an event POST Trigger an event for single app Webhooks POST Create Webhook PUT Update Webhook GET Get all webhooks GET Get webhook by ID DEL Delete webhook POST (Deprecated) Subscribe to events POST (Deprecated) Unsubscribe from an event Executions GET Get execution by ID GET Get all executions Session Token POST Generate Token for Linked Account Cobalt Hosted POST Create Hosted URL GET Get hosted properties Applications Get all applications GET / api / v2 / public / application This API lists all enabled applications for a specific linked account. ​ Request description ​ Headers ​ linked_account_id string required Unique customer identification id. For Eg: markwood@some_email.com ​ Response description 200 Error response ​ name string Application name ​ icon string Application icon ​ description string Application description ​ auth_type string Authentication type supported by the app ​ type string Application type ​ app_id string Application record id ​ tags array Array of application tags. ​ version object Version object Show properties ​ _v string Application version ​ description string version description ​ connected boolean This field is present only if an app has been connected. This field provides information whether the app has been integrated by the linked account ​ connected_accounts array This field provides description of the account connected. Present only if an app has been connected. Show properties ​ identifier string identifier of the account connected with the app ​ connectedAt date Time of last connection ​ auth_input_map array This field is present only if auth_type is keybased . Provides the input field details to be shown to the linked account for app connection. Show properties ​ name string Field name ​ label string Field label ​ placeholder string Field placeholder ​ required boolean If the field is a required field ​ type string Type of the input field. Accepted values: text , number , boolean , select . ​ options array Array of option strings if type is select ​ slug string Application slug ​ reauth_required boolean This field tells if a re-auth is required from the user for the application Delete linked account Get application by Slug linkedin twitter Powered by Mintlify"
}