{
    "url": "https://docs.gocobalt.io/api-reference/config-fields/get-all-fields",
    "text": "Get All Config Fields - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Config Fields Get All Config Fields Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples About API Reference Overview Linked Account GET Get linked account by ID GET Get all linked accounts POST Create linked account PUT Upsert linked account DEL Delete linked account Applications GET Get all applications GET Get application by Slug PUT Migrate Token for a Linked Account Config POST Upsert Config PUT Update Config GET Get All Installed Configs GET Get Config by ID DEL Delete Config Config Fields POST Get All Config Fields Datastores GET Get all Config Datastores GET List Records in Datastore POST Search Datastore Records Event POST Trigger an event POST Trigger an event for single app Webhooks POST Create Webhook PUT Update Webhook GET Get all webhooks GET Get webhook by ID DEL Delete webhook POST (Deprecated) Subscribe to events POST (Deprecated) Unsubscribe from an event Executions GET Get execution by ID GET Get all executions Session Token POST Generate Token for Linked Account Cobalt Hosted POST Create Hosted URL GET Get hosted properties Config Fields Get All Config Fields POST / api / v2 / public / config / field This API retrieves all the fields in a config for an application using its unique identifier. ​ Request description ​ Headers ​ linked_account_id string required Unique customer identification id. For Eg: markwood@some_email.com ​ disable_field_options boolean If true, field options will not be returned in the response. ​ Path Parameters ​ slug string required Application Slug. Eg: docusign ​ Response description 200 Error response ​ slug string Application slug ​ config_id string Unique ID of the created config ​ fields array Global input fields of an application Show properties ​ id string Unique field id ​ name string Field display name ​ field_type string Field input type. Expected values: text , number , select , map ​ options array Options array for the select field, or map field. Show properties ​ name string Display name ​ value string Value ​ required boolean If the field is a required field. ​ labels array Dynamic fields for user to map data to the map options. Show properties ​ name string Display name ​ value string Value ​ workflows array Published workflows of the application Show properties ​ id string Workflow ID ​ name string Workflow name ​ description string Workflow description ​ enabled boolean If the workflow is enabled for the linked account ​ fields array Workflow specific input fields Show properties ​ id string Unique field id ​ name string Field display name ​ field_type string Field input type. Expected values: text , number , select , map ​ options array Options array for the select field, or map field. Show properties ​ name string Display name ​ value string Value ​ required boolean If the field is a required field. ​ labels array Dynamic fields for user to map data to the map options. Show properties ​ name string Display name ​ value string Value Delete Config Get all Config Datastores linkedin twitter Powered by Mintlify"
}