{
    "url": "https://docs.gocobalt.io/api-reference/customer/upsert-a-linked-account",
    "text": "Upsert linked account - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Linked Account Upsert linked account Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples About API Reference Overview Linked Account GET Get linked account by ID GET Get all linked accounts POST Create linked account PUT Upsert linked account DEL Delete linked account Applications GET Get all applications GET Get application by Slug PUT Migrate Token for a Linked Account Config POST Upsert Config PUT Update Config GET Get All Installed Configs GET Get Config by ID DEL Delete Config Config Fields POST Get All Config Fields Datastores GET Get all Config Datastores GET List Records in Datastore POST Search Datastore Records Event POST Trigger an event POST Trigger an event for single app Webhooks POST Create Webhook PUT Update Webhook GET Get all webhooks GET Get webhook by ID DEL Delete webhook POST (Deprecated) Subscribe to events POST (Deprecated) Unsubscribe from an event Executions GET Get execution by ID GET Get all executions Session Token POST Generate Token for Linked Account Cobalt Hosted POST Create Hosted URL GET Get hosted properties Linked Account Upsert linked account PUT / api / v2 / public / linked-account This API updates the details of an existing linked account or creates a new one if no account exists for the provided linked account ID. ​ Request description ​ Body Parameters ​ linked_account_id string required Unique customer identification id. For Eg: markwood@some_email.com ​ name string User name. for Eg: Mark Wood ​ your_app object An object containing the details of your application associated with your account. Passing an empty your_app object without auth_credentials will throw an API Error. It is recommended to either do not pass your_app object or pass it with auth_credentials. Show properties ​ auth_credentials object API Credentials of your customers which will be used to make calls to your APIs. These credentials can have any key name that you want to set for your own APIs like email, password, base-url etc. Hide example properties ​ x-api-key string Sample key name for credentials ​ base-url string Sample key name for credentials ​ udf object An object containing user-defined fields (if any) associated with the linked account. Show example properties ​ sample_key_1 string Example credentials ​ base-sample_key_2 string Example credentials ​ Response description 200 Error ​ _id string index id of the record created ​ associated_org string Organization Id ​ account_id string Linked account id ​ environment string Environment in which the account was created ​ name string Name of the linked account ​ udf array Initial values passed while creating the linked account. User can pass any values of primitive datatypes. ​ createdAt date Creation time ​ updatedAt date `Last update time ​ __v integer Create linked account Delete linked account linkedin twitter Powered by Mintlify"
}