{
    "url": "https://docs.gocobalt.io/api-reference/datastore/search-config-records",
    "text": "Search Datastore Records - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Datastores Search Datastore Records Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples About API Reference Overview Linked Account GET Get linked account by ID GET Get all linked accounts POST Create linked account PUT Upsert linked account DEL Delete linked account Applications GET Get all applications GET Get application by Slug PUT Migrate Token for a Linked Account Config POST Upsert Config PUT Update Config GET Get All Installed Configs GET Get Config by ID DEL Delete Config Config Fields POST Get All Config Fields Datastores GET Get all Config Datastores GET List Records in Datastore POST Search Datastore Records Event POST Trigger an event POST Trigger an event for single app Webhooks POST Create Webhook PUT Update Webhook GET Get all webhooks GET Get webhook by ID DEL Delete webhook POST (Deprecated) Subscribe to events POST (Deprecated) Unsubscribe from an event Executions GET Get execution by ID GET Get all executions Session Token POST Generate Token for Linked Account Cobalt Hosted POST Create Hosted URL GET Get hosted properties Datastores Search Datastore Records POST / api / v2 / public / datastore / config / :slug / :datastore_name / search This API searches for records within a config datastore. ​ Request description ​ Headers ​ linked_account_id string required Unique customer identification id. For Eg: markwood@some_email.com ​ Path Parameters ​ slug string required Application Slug. Eg: hubspot ​ datastore string required Name of the datastore to be searched. ​ Body Parameters ​ record_id string Unique ID of the record. ​ item string Key/ item name. ​ value string Value of a key to use for search. If the Request Body is sent as empty, the API response will be an empty array. ​ Response description 200 Error response ​ record_id string Unique ID of the record. ​ item string Name of the key or item. ​ value string String stored as the value of the item. List Records in Datastore Trigger an event linkedin twitter Powered by Mintlify"
}