{
    "url": "https://docs.gocobalt.io/build/workflow/internal_functions",
    "text": "Internal Functions - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Nodes Internal Functions Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Workflows Overview Triggers Nodes Custom Code Node Data Mapper Delay Node Loop Node HTTP Node Internal Functions Merge Node PDF Node Response Node Rule Node Send Email Node Transform Node Human Task Data Variables Workflow Testing Templating in Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Nodes Internal Functions Create reusable functions or provides built-in, non-editable library functions in workflows. A Custom Code node is used to solve any data-related issues that required coding in the workflows. If the same code was needed at multiple places, the users need to use a Custom code node with the same code in different workflows. If you want to learn more about Custom Code Node, refer here . To reduct this repetitive process, the solution is the Functions node. Using this, you can create reusable functions at the global level for your Cobalt account, which can then be used inside workflows. ​ Create your Functions You can create your own functions to be used in the node by providing three things: Code for the function Input fields Output fields. Learn how to create your functions. Stay Tuned! ​ Pre-defined Library functions You can also use some pre-defined functions, also known as Library functions offered by Cobalt. These functions show up in the Functions node by default and can’t be edited. Few of the library functions are: Find element in array, Encrypt string, Get current date; & many more. Once you select a function, simply provide the required inputs to perform it. HTTP Node Merge Node linkedin twitter Powered by Mintlify On this page Create your Functions Pre-defined Library functions"
}