{
    "url": "https://docs.gocobalt.io/build/workflow/tables",
    "text": "Tables by Cobalt - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Advanced Features Tables by Cobalt Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Workflows Advanced Features Data Refs Tables by Cobalt User Forms Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Advanced Features Tables by Cobalt Tables by Cobalt allows users to manage and use dynamic data generated within workflows and are structured with rows and columns. ​ Tables Types The type of a Table can be chosen by the user when the Create Table action is selected in the Tables by Cobalt node. You can only create a Persistent table when you create one using the New Table option in dashboard. It can be of two types: ​ Non-Persistent Table This type of Table and its data is available only within the context of the workflow execution and gets deleted once instance execution is completed. It cannot be accessed through Tables in dashboard. ​ Persistent Table This Table and its data can be accessed across all the workflows in any application and are not deleted until user explicitly deletes them. You can find the list of all Persistent Tables in your Cobalt dashboard. ​ Tables in dashboard All persistent tables created in the Cobalt platform can be accessed by navigating to Settings > Tables . This section provides details about each table, such as its ID and Name. Additionally, you can click on any Table to view and manage its records directly from this interface. ​ Limitations in Tables A table has the following constraints: Table can have max 10 columns . Table can have max 50,000 rows/records . ​ Table Actions Table node offers a range of actions which can be used in a Workflow: Create Table Users can create new Table within workflows, specifying its Type (Persistent or Non-Persistent) and defining the structure of the Table records. While using this action, the user is required to provide information like the Type , Name and the Columns for the Table. You can also create a Persistent table in the dashboard by clicking on the New Table option and then access it directly in the workflow. Delete Table Users have the option to delete existing Tables by providing the Table ID . Get Tables Users can retrieve a list of all Tables by providing the type of tables which they want to fetch. Add Table Record Users can add new records to a Table, by selecting the Table and then adding the required data. Search Table Records Users can search for specific records within a Table by searching for records based on any of the columns’ value. Get Table Records Users can retrieve all the records of a Table by providing its Table ID . Update Table Record Users can update existing records of a Table by entering the new values in the respective fields to update. Delete Table Record Users can delete specific records from a Table by providing the unique Record_Id of the record which was generated. Data Refs User Forms linkedin twitter Powered by Mintlify On this page Tables Types Non-Persistent Table Persistent Table Tables in dashboard Limitations in Tables Table Actions"
}