{
    "url": "https://docs.gocobalt.io/build/workflow/variables",
    "text": "Data Variables - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Workflows Data Variables Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Workflows Overview Triggers Nodes Human Task Data Variables Workflow Testing Templating in Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Workflows Data Variables These are variables that capture and store data from within the workflow or events, allowing users to map logic within workflows dynamically. ​ Accessing Variables When configuring workflow nodes, users can access Dataslots by clicking on any Input Field in the node. This provides access to a wide range of variables, allowing users to select and utilize the appropriate data for their workflows. Each variable is accompanied by its data type, displayed below the variable name. ​ Types of Variables Users can search for variables in the Insert Variable section. Variables in Cobalt are of three types: ​ DataSlots DataSlots includes variables sourced from the Application or Workflow Config created by you. Few default meta variables are also available under the Workflow Dataslots. Learn more about Config here . ​ Event Event represents the variables that you receive in the Payload of the event. These can be used in the workflow to pass data dynamically. ​ Nodes Nodes represent data from nodes present within the current workflow. They enable users to access and utilize data generated by previous workflow nodes. If you have performed a test execution of the nodes through Input/Output option, you will be able to see the fields generated in response of that node as variables in further nodes. Human Task Workflow Testing linkedin twitter Powered by Mintlify On this page Accessing Variables Types of Variables DataSlots Event Nodes"
}