{
    "url": "https://docs.gocobalt.io/build/connectors/add_to_marketplace",
    "text": "Build your Marketplace Ecosystem - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Connectors Build your Marketplace Ecosystem Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Overview Config Build your Marketplace Ecosystem Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Connectors Build your Marketplace Ecosystem Ecosystem allows you to create your marketplace where users can vote and request for integrations so that you can easily priortise your next app. Apart from the enabled apps, you can add any integration supported by Cobalt using the Ecosystem feature. You can access it by navigating to Ecosystem under Advanced in the dashboard. ​ Add app to Ecosystem To add any integration to your Ecosystem, navigate to that app in Cobalt and click on the Add to Ecosystem button. Add to Ecosystem button will not be available if the app has already been enabled. Once added, the integration will be visible under Upvotes tab in the Ecosystem with the number of upvotes or request the app has received from linked accounts. ​ Requesting access to integrations The integrations that you add to Ecosystem will be visible to the Linked Accounts with the Request Access button in the Hosted Portal. When the user clicks on the button, a form will open up asking for basic details about the request. Learn more about Hosted Portal here . Once requested, you can see the leads of the app request under Leads tab in the Ecosystem. You have successfully setup an Ecosystem of integrations for your users. Rule Engine Overview linkedin twitter Powered by Mintlify On this page Add app to Ecosystem Requesting access to integrations"
}