{
    "url": "https://docs.gocobalt.io/build/workflow/rule",
    "text": "Rule Node - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Nodes Rule Node Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Workflows Overview Triggers Nodes Custom Code Node Data Mapper Delay Node Loop Node HTTP Node Internal Functions Merge Node PDF Node Response Node Rule Node Send Email Node Transform Node Human Task Data Variables Workflow Testing Templating in Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Nodes Rule Node The Rule Node in Cobalt enables users to define conditions that must be met for further execution within a workflow. By adding rule nodes along with start nodes and app nodes, users can add conditional logic that executes different paths. ​ Steps to use Rule Node To utilize the Rule Node effectively, follow these steps: 1 Create Workflow Begin by navigating to the respective app and creating a new workflow. Add an event and publish the workflow to make it operational. Learn more about Workflows here . 2 Add Rule Within the workflow, add a rule node as per your requirement along with other nodes to define the workflow flow. 3 Define Rule Condition Configure the rule node by selecting the appropriate rule condition. First, select the Condition Rule for the node which can either be Match Any Condition or Match All Conditions . In Compare Values of , click on + Map Fields and specify the variable , operator and value for the condition. Multiple Conditions can be applied in a single node by clicking on + Map Fields button. The Rule Node offers various Operators or Conditions which you can use based on your requirement. If the specified rule condition is met during execution, the actions to be performed should now be added to the left node connect of Rule node which is for True otherwise connect to the right end. Response Node Send Email Node linkedin twitter Powered by Mintlify On this page Steps to use Rule Node"
}