{
    "url": "https://docs.gocobalt.io/build/basics/account-management/access",
    "text": "Access - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Account Management Access Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Linked Accounts Org Developer Settings API Proxies Events Webhooks Account Management General Team Access Brand Connectors Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Account Management Access The Access section within Cobalt’s Account Management allows account owners to maintain control over their account access. ​ Allowing Access to Cobalt Account owners have the option to grant Cobalt access to their account by clicking the Allow Access button. This action enables Cobalt to perform certain tasks or access specific data within the account, as authorized by the account owner. Account Owners can revoke the access by clicking on the Revoke Access button. By default, access to the account is restricted to the account owner, ensuring data privacy and security. ​ Access Approval History The Access section provides visibility into the Access Approval History , allowing users to track and monitor access requests over time. Each access request is logged with a status indicating whether it is Active or Revoked , providing account owners with insight into the current access permissions granted to Cobalt. ​ Compliance and Security The Access feature in Cobalt is designed to meet compliance requirements while prioritizing data privacy and security. By giving account owners full control over their account access and providing transparency into access approval history, Cobalt ensures that organizations can maintain regulatory compliance and safeguard sensitive data effectively. Team Brand linkedin twitter Powered by Mintlify On this page Allowing Access to Cobalt Access Approval History Compliance and Security"
}