{
    "url": "https://docs.gocobalt.io/build/workflow/human_task",
    "text": "Human Task - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Workflows Human Task Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Workflows Overview Triggers Nodes Human Task Data Variables Workflow Testing Templating in Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Workflows Human Task Human Task is the way to involve human input in workflow execution to bring a layer of user interaction. It allows you to send forms to your users during workflow execution and use the response received in further nodes. ​ Pre-requisite To use the Human Task feature, you need to have the following: ​ Configure your SMTP Credentials. Follow the steps below to configure: 1 Navigate for setup In the platform, click on your profile in the to right corner and select Account . Switch to Email tab. 2 Provide required credentials & test Fill in the SMTP credentials and test them by clicking on Send Email button. If it was successful, your connection is established. ​ User Forms User forms define the form layout that you will send to your users to receive the inputs. You need to have atleast one user form to use in the Human Task node. Learn more about User Forms and how to create one here . ​ Human Task in workflow In the workflow where you want a form to be sent to users, add the Human Task node. ​ Human Task node setup In the node, you can configure information about how you want to send the form to your users. Using the Timeout field, you can set the time in minutes until which the form will be available. Provide rest of the information such as Sender Email , Receiver’s Emails , Subject and Body of the email. You also need to select the User form which you want to send by choosing it from the dropdown in Forms field. Once you select a form, the fields defined in the form will get auto generated in the node and you can insert static data or another node’s response in those fields. Once done, click on Save . ​ Human Task in Workflow execution Once the workflow with human task node is executed, the form will be sent to the receivers. The Human Task Node will be in waiting state in execution Logs until the timeout period gets over or the forms get submitted. In the email received, a form link is available for receivers to fill. The form looks like below: Once the form gets submitted, the workflow will continue further execution and you can access the form response in further nodes. The form_status field received in the response of the node will either be timeout or submitted . Transform Node Data Variables linkedin twitter Powered by Mintlify On this page Pre-requisite Configure your SMTP Credentials. User Forms Human Task in workflow Human Task node setup Human Task in Workflow execution"
}