{
    "url": "https://docs.gocobalt.io/concepts/workflow/merge",
    "text": "Merge Node - Cobalt Cobalt home page v1 Search... Dashboard Contact Us Dashboard Search... Navigation Nodes Merge Node Documentation Guides API Reference SDKs Resources Cobalt home page v1 Postman Get Your API Key Examples Documentation Introduction Quickstart Glossary Implementation Guide Get Started Integrate Communicate Test Integration Additional Deploy Concepts Linked Accounts Auth Flows Logs Workflow Overview Workflow API Workflow Testing Templating in Workflows Dataslots Nodes Custom Code Node (Deprecated) Datastore Node Delay Node Group Node HTTP Node Merge Node PDF Node Response Node Rule Node Send Email Node Transform Node App Config Integrations Custom Apps Nodes Merge Node The Merge Node in Cobalt provides a fundamental functionality for combining multiple branches of a workflow into a single flow. This is particularly useful when there are parallel processes within a workflow that need to converge at a common point before proceeding with the subsequent actions. ​ Use Case for Merge Consider a scenario where two parallel processes need to run simultaneously, and once both processes are completed, a common action or set of actions should be executed. So rather than replicating the same flow for each branch, leading to increased complexity and a higher number of nodes, the Merge Node allows these branches to converge seamlessly. The Merge will not be successful if any of the nodes which are being merged through the Merge Node are failing. ​ Example Scenario Parallel Processing : You have three branches/nodes running different processes in parallel. Convergence : Once all three branches complete their respective tasks, they need to converge to perform a common action, such as creating a datastore or any other action. By using the Merge Node, you can bring both branches together, eliminating the need to duplicate the subsequent steps for each branch. HTTP Node PDF Node linkedin twitter Powered by Mintlify On this page Use Case for Merge Example Scenario"
}