{
    "url": "http://docs.gocobalt.io/deployment/hosting/intro#single-tenant-hosting",
    "text": "Cobalt Hosting Solutions - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Hosting Solutions Cobalt Hosting Solutions Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Cobalt Hosting Solutions AWS Deployment Azure GCP Deployment Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Hosting Solutions Cobalt Hosting Solutions Choose a hosting option that best fit for your needs Cobalt is certified in GDPR, ISO 27001:2022, and SOC 2 Type 2, adhering to the policies and procedures mandated by these standards. Our cloud and managed on-premise solutions fully comply with the requirements of these certifications. For more information, visit our Security Center . ​ Overview Explore the multiple hosting options below to suit a variety of needs: Cloud Hosting : Hassle-free SaaS managed entirely by Cobalt. Managed On-Premise Hosting : On-premise control with managed infrastructure. Single-Tenant Hosting : Dedicated resources for greater data isolation. 🕒 Launching Soon ​ Hosting Solutions Comparison Feature Cloud Hosting Single-Tenant Hosting Managed On-Premise Hosting Platform GCP GCP (exclusive) AWS, Azure, GCP (customer credentials required) Location United States, Europe Custom region selection Customer-defined (based on cloud provider) Setup Easy, minimal effort Requires more configuration Requires infrastructure setup and DevOps capabilities Traffic Capacity Up to 10 million requests/month Over 10 million requests/month Over 1 million requests/month Customization Limited Full customization, including branded domains Full control over infrastructure and data Support Responsive, fast support Dedicated support Managed service with technical support Data Isolation Shared resources Full data segregation Complete isolation within your infrastructure Update Frequency Frequent, multiple updates per week Not applicable Managed updates per customer needs Scalability Limited scalability for high traffic workloads Scalable for high traffic demands Scalable with full control over resources Region-Specific Hosting Not for outside U.S. or Europe Customizable for specific regions Full regional control based on cloud provider Best For Low to moderate traffic, simple infrastructure High traffic, strict data isolation, dedicated resources Data-sensitive industries, high traffic, DevOps teams Limitations No support for non-U.S./Europe regions, large payloads GCP-only compatibility, not suitable for multi-cloud Requires DevOps setup, may need specific cloud provider setup ​ Cloud Hosting Cobalt’s Cloud Hosting is a robust SaaS solution designed to simplify operations through automated updates and cutting-edge features. Cobalt handles releases, patch management, security, and incident response, ensuring a seamless and stress-free hosting experience. Our platform leverages GCP infrastructure, with server locations in the United States and Europe . Start using our web application within minutes . ​ Key Benefits Easy setup: Quickly launch your operations with minimal effort. Frequent updates: Enjoy enhancements delivered multiple times per week. Responsive support: Benefit from fast, reliable technical assistance. ​ Best For Organizations without regulatory constraints for region-specific data hosting. Applications with low to moderate traffic volumes (up to 10 million requests/month ). Teams looking to avoid the complexities of infrastructure management. ​ Limitations Not suitable for hosting data outside the U.S. or Europe. Not designed for high traffic (over 10 million requests/month ). Unsuitable for workloads involving long-running processes (>1 minute) or large payloads (>100 MB). ​ Single-Tenant Hosting Cobalt’s Single-Tenant Hosting offers dedicated resources tailored to your needs, including virtual private clouds (VPCs), networks, databases, and servers. ​ Key Benefits Custom hosting locations: Host your data and servers in a region that aligns with your requirements. Exclusive resources: Ensure complete data segregation from other customers. Enhanced reliability: Experience greater fault tolerance compared to shared hosting. Branded domains: Utilize a fully managed hosting solution with custom branding options. ​ Best For Businesses with strict data isolation and regional hosting requirements. Applications with high traffic demands (over 10 million requests/month ). Organizations seeking to fully outsource infrastructure management. ​ Managed On-Premise Hosting Managed on-premise hosting combines the security, isolation, and performance of on-premise infrastructure with the convenience and scalability of a cloud service. It’s a hybrid solution designed for enterprise customers who want the best of both worlds. In this offering, you provide AWS, Azure, or GCP credentials with restricted access, and Cobalt takes care of the deployment and management. Your data remains entirely contained within your own infrastructure, ensuring complete control and compliance. Learn more about configuring managed hosting for your cloud provider: AWS Setup Azure Setup GCP Setup ​ Key Benefits Data Control: Your data remains hosted in your preferred location, ensuring compliance and security. Managed Service: Fully managed service with unrestricted volume access Data Isolation: Maintain data security with full isolation and the ability to use your domains. ​ Best For Organizations needing data segregation and regional hosting High traffic (over 1 million requests/month ) Teams with DevOps capabilities to configure and manage infrastructure By choosing the hosting solution that best fits your requirements, you can optimize for scalability, security, and compliance while minimizing operational overhead. Cobalt Deployment AWS Deployment linkedin twitter Powered by Mintlify On this page Overview Hosting Solutions Comparison Cloud Hosting Key Benefits Best For Limitations Single-Tenant Hosting Key Benefits Best For Managed On-Premise Hosting Key Benefits Best For"
}