{
    "url": "https://docs.gocobalt.io/governance/certifications",
    "text": "Compliance & Certifications - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Governance & Compliance Compliance & Certifications Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Governance & Compliance Compliance & Certifications Discover the compliance frameworks Cobalt adheres to, demonstrating our commitment to industry-standard security guidelines and best practices. ​ Cobalt’s Security Compliance and Framework Cobalt undergoes regular security audits and adheres to leading industry standards, including: SOC 2 Type 1 : Demonstrating our initial compliance with the security principles for data protection. SOC 2 Type 2 : Showcasing our ongoing commitment to maintaining secure data practices over time. ISO 27001:2022 : Complying with the international standard for information security management systems (ISMS) to ensure a systematic and secure approach to managing sensitive information. GDPR : Aligning with the General Data Protection Regulation to uphold data privacy and protection for our partners and customers. VAPT (Vulnerability Assessment and Penetration Testing) : Conducting rigorous testing to identify and mitigate security vulnerabilities, ensuring robust defenses against potential threats. This comprehensive security framework underscores the commitment to delivering secure and reliable services while continually enhancing processes to protect the business, partners, and their data. Customers can request a copy of our reports through our dedicated Security Center or by emailing us at support@gocobalt.io . Application Security Privacy Policy linkedin twitter Powered by Mintlify On this page Cobalt’s Security Compliance and Framework"
}