{
    "url": "https://docs.gocobalt.io/implementation/overview",
    "text": "Get Started - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Implementation Guide Get Started Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Implementation Guide Get Started Integrate Communicate Test Integration Additional Deploy Examples Build Salesforce Integration Build NetSuite Integration Build Workday Integration Solutions 2 Way Data Sync Data Import Push Data to External Connector Implementation Guide Get Started In this integration guide, you will sign up for a Cobalt Developer Account, set up Cobalt Connect, integrate the Cobalt API and go into production. Follow these simple steps to implement Cobalt. Sign up for a free account to receive your credentials and API Keys and understand how Cobalt simplifies building integrations for you. Integrate Cobalt Connect into your frontend. (Cobalt Connect is the user inferface that allows your customers to safely and securely grant your application access to their account.) You can opt to redirect to Cobalt Hosted Flow or build your own UI using Cobalt SDKs. Integrate the Cobalt API or SDK into your application’s backend. Read and Write Data to Third-party Apps from Cobalt. Optimize and test your application and workflows to maintain a smooth user experience using Cobalt. Once your integration has been tested thoroughly, go live with all of your customers. So let’s get started!! Create your account now. ​ Frontend + Backend For a full implementation, Cobalt requires both a frontend and a backend application to exist. The frontend application coordinates connecting the user with various integrations, and the backend server securely manages the requests and responses to and from Cobalt APIs. ​ Frontend Development Cobalt Auth flows lets your users connect their integration accounts. It stores the credentials securely and lets you make authorized API calls on your users’ behalf (linked account in Cobalt). There are three ways to integrate Cobalt into your application’s frontend user interface. Hosted flow : In this method you can effortlessly redirect your users’ to Cobalt Connect, which is securely hosted by Cobalt. Embedded flow : It is a good option if you want your client team to be responsible for the integration of Cobalt Connect into your app. You can use the Cobalt Connect JavaScript SDK or the Cobalt Connect React SDK to build your own custom UI for Cobalt Connect. Both SDKs make it easy to let your users authorize and manage integrations with just a few lines of code. Seamless flow : If you want your backend team to handle the integration, you can use the Connect API directly to create your own integration experience inside your app. ​ Backend Development Once the connection has been created via Cobalt frontend, you can now implement .connect() and .disconnect() function of Cobalt Client-side SDK to allow your end-users to make or break a connection with the integrations. We offer NodeJS backend SDKs to make the backend integration smoother. Create a Cobalt Developer Account linkedin twitter Powered by Mintlify On this page Frontend + Backend Frontend Development Backend Development"
}