{
    "url": "https://docs.gocobalt.io/maintain/logs",
    "text": "Observability with Logs - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Maintain Observability with Logs Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Maintain Observability with Logs Logs in Cobalt allow you to monitor workflows, troubleshoot errors during executions, and gain insights into platform activities. There are various types of Logs that you can see in Cobalt: ​ Workflow Logs Workflow Logs or Executions is able to provide various details about a workflow that was executed. With features such as detailed execution details and request/response data, workflow logs enable users to gain deeper insights into the execution process and ensure optimal performance. To view the Logs, navigate to Logs in Cobalt and check the Executions tab. You can even filter out the logs based on Workflow name, Status, Linked Account etc. Key Functionalities To test a workflow in Cobalt, user can also execute a workflow through the Try API section in Cobalt. To learn more about Try API and how it can be used, refer to our guide here . Some of the key functionalities of Workflow logs are described in details below: Node Activity Details By clicking on a workflow log, users can view the activity of individual nodes present in the workflow. This includes information about the status or errors encountered by each node, response etc. providing insights into the execution flow and potential points of failure. Retry Functionality For workflows that encounter errors, users have the option to retry execution by clicking on the Retry button in the top right corner of the Workflow details. The retry functionality is limited to a single attempt. ​ Event Logs Event logs in Cobalt provide information about the triggers and events called. To learn more about Event in Cobalt, refer to our guide here . To access the Event Logs, navigate to the Logs section in Cobalt and select the Events tab. You can filter the logs based on Event name, Status and Linked Account ID etc. Each Event Log entry provides you information about the Workflows that got executed on Event call, the Event URL and the Payload that was sent in the event. The Workflows section will not be visible if there was no Workflow that was associated with the event. ​ Webhook Logs Webhook logs allows users to monitor the execution of webhooks subscribed to in Cobalt. Webhook logs provide detailed information about each webhook event, including its Execution status , Linked Account ID , fired date and more. To access the Webhook Logs, navigate to the Logs section in Cobalt and select the Webhooks tab. To learn more about Webhooks in Cobalt and how they can be subscribed, refer to our guide here . For each webhook event, users can view the associated request and response data, providing insights into the interaction between Cobalt and external systems. ​ Schedule Logs Schedule Logs provide users with visibility into scheduled workflows and their associated details. To access the Schedule Logs, navigate to the Logs section in Cobalt and select the Schedules tab. In Cobalt, Schedule Logs offer a comprehensive view of scheduled workflows, displaying essential information such as: Workflow Name and ID Identifies the workflow scheduled for execution. Schedule Cron Specifies the cron expression defining the schedule for workflow execution. Event Indicates the Event ID triggering the scheduled workflow. Status Reflects the current status of the scheduled workflow, either Active or Inactive . These details enable users to quickly identify scheduled workflows, understand their configurations, and track their status within the Cobalt platform. Try API Reliability linkedin twitter Powered by Mintlify On this page Workflow Logs Event Logs Webhook Logs Schedule Logs"
}