{
    "url": "https://docs.gocobalt.io/resources/integration-providers/calendly",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Calendly Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Setup Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Calendly Setup Connect to your Calendly app for OAuth. To setup your Calendly app in Cobalt for OAuth, you will need the following credentials from your Calendly Developer Portal : Client ID Client Secret Scopes ​ Pre-requisites Calendly Developer account. You can create one here . If you haven’t already created an app in Calendly, you’d need to create one. ​ Creating an app in Calendly To create a Calendly app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Calendly Developer Portal . Click on the Profile icon in the top right, select My Apps and click on the + Create new app button. Go to your Apps catalog in Cobalt > Search for Calendly > Settings > Use your credentials > Callback Url > Copy it. After clicking on + Create new app button, enter the App Name , select Kind of app as Web , choose Environment Type , paste the Callback Url under Redirect URI and click on Save and continue . Copy the Client ID and Client Secret displayed. Client Secret and Webhook signing key will be visible only once, so make ensure that they are copied and saved somewhere for future reference. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth2 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Calendly actions and triggers. Following are the set of Calendly actions and triggers supported by Cobalt. Actions Triggers Events List Events - List all scheduled events in Calendly. Get Event - Get a scheduled event in Calendly. Cancel Event - Cancel a scheduled event in Calendly. Groups List Groups - List all groups in Calendly. Get Group Relationship - Get a group relationship in Calendly. Others HTTP Request - Make HTTP API calls to any Calendly documented REST APIs. Get Current User - Get the current user’s details in Calendly. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Calendly Configuring credentials in Cobalt Actions and triggers"
}