{
    "url": "https://docs.gocobalt.io/resources/integration-providers/notion",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Notion Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion Setup OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Notion Setup Connect to your Notion app for OAuth. To setup your Notion app in Cobalt for OAuth, you will need the following credentials from your Notion Integrations Page : Client ID Client Secret Scopes ​ Pre-requisites Notion account. You can create one here . ​ Required Settings Mandatory Scopes Read user information including email address Insert comments If you haven’t already created an app in Notion, you’d need to create one. ​ Creating an app in Notion To create a Notion app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Notion Integrations Page . Click on + New integration button in the left. Select a workspace , give the app a Name and click on the Submit button. Navigate to Capabilities in the left menu, select the mandatory scopes and click on Save changes . Scopes or Permissions for Notion app can be configured only through the Capabilities section of the app in Notion Integrations Page. Go to your Apps catalog in Cobalt > Search for Notion > Settings > Use your credentials > Callback Url > Copy it. To get the Client ID and Client Secret in Notion, the app needs to made public. Navigate to Distribution and Enable to make the integration public. Fill the required information about organization and paste the Callback Url under Redirect URIs in OAuth Domains and URIs section. Click on Submit . Navigate to Secrets and copy the OAuth client ID and OAuth client secret . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Notion actions and triggers. Following are the set of Notion actions and triggers supported by Cobalt. Actions Triggers Database Create Database - Create a database in Notion. Update Database - Update a database in Notion. Retrieve Database - Retrieve a database in Notion. Page Create Page - Create a page in Notion. Search - Find Page (by title) in Notion. Others HTTP Request - Make HTTP API calls to any Notion documented REST APIs. Create Comment - Create a comment in Notion. OAuth Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Notion Configuring credentials in Cobalt Actions and triggers"
}