{
    "url": "https://docs.gocobalt.io/resources/integration-providers/chargify",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Chargify Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify Connect ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Chargify Connect Connect with the Linked Account’s Chargify account. Chargify is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Chargify integration, a Linked Account or an end-user will need to provide the following to connect: API Key Base URL To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Maxio Chargify To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Chargify account . Click on Select a Site dropdown in the side menu and choose a site . Copy the Base URL of your site now. Click on Config in the side menu > Choose Integrations > Select API Keys . Click on the New API Key button and copy the API key displayed. Copy the API Key as it will not be shown again. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Chargify actions and triggers. Following are the set of Chargify actions and triggers supported by Cobalt. Actions Triggers Customers List Customers - List customers in Chargify. Create Customer - Create a customer in Chargify. Update Customer - Update a customer in Chargify. Delete Customer - Delete a customer in Chargify. Invoices List Invoices - List invoices in Chargify. Get Invoice - Get an invoice in Chargify. Void Invoice - Void an invoice in Chargify. Subscriptions Create Subscription - Create a subscription in Chargify. Find Subscription - Find subscription in Chargify. Update Subscription - Update a subscription in Chargify. Others HTTP Request - Make HTTP API calls to any Chargify documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Maxio Chargify Actions and triggers"
}