{
    "url": "https://docs.gocobalt.io/resources/integration-providers/servicenow",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation ServiceNow Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Connect Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom ServiceNow Connect Connect with the Linked Account’s ServiceNow account. ServiceNow is a Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the ServiceNow integration, a Linked Account or an end-user will need to provide the following to connect: Instance URL Username Password To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of ServiceNow To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your ServiceNow Developer account . Click on the Profile icon in the top right corner and select Manage Instance Password . Copy the Instance URL , Username and Password displayed on the screen. ​ Activate Plugins in ServiceNow Instance To use some of the APIs of ServiceNow, specific Plugins activation is required. For example, to use the Case and Contact API of ServiceNow, Customer Service plugin (com.sn_customerservice) needs to be activated. To activate a plugin, follow these steps: Login into your ServiceNow instance. In the top nav bar, click on All and go to Plugins under System Definition . Under Available for You tab, search for the required plugin > Open it and click on Install button. You have now successfully activated the Plugin. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using ServiceNow actions and triggers. Following are the set of ServiceNow actions and triggers supported by Cobalt. Actions Triggers Attachment Get Attachment - Get an attachment in ServiceNow. Upload Attachment - Upload an attachment in ServiceNow. Case Create Case - Create a new case in ServiceNow. Get Case - Get case by ID in ServiceNow. Update Case - Update a case in ServiceNow. Contact Creat Contact - Create contact by ID in ServiceNow. Get Contact - Get contact by ID in ServiceNow. List Contacts - List all contacts in ServiceNow. Others HTTP Request - Make HTTP API calls to any ServiceNow documented REST APIs. Connect Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of ServiceNow Activate Plugins in ServiceNow Instance Actions and triggers"
}