{
    "url": "https://docs.gocobalt.io/resources/integration-providers/bitbucket",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Bitbucket Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Setup Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Bitbucket Setup Connect to your Bitbucket app for OAuth. To setup your Bitbucket app in Cobalt for OAuth, you will need the following credentials from your Bitbucket Account : Client ID Client Secret Scopes ​ Pre-requisites Bitbucket Account. You can create one here . ​ Required Settings Mandatory Scopes Account If you haven’t already created an app in Bitbucket, you’d need to create one. ​ Creating an app in Bitbucket To create a Bitbucket app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Bitbucket Account . Click on your Profile in the top right corner, go to the All workspaces page and select a Workspace. Go to Workspace Settings > Apps and Features in the side menu > OAuth consumers and click Add consumer button. Go to your Apps catalog in Cobalt > Search for Bitbucket > Settings > Use your credentials > Callback Url > Copy it. Enter the App Name and paste the Callback URL . Select the mandatory scopes in the Permissions section, as provided in your Cobalt Bitbucket settings page and click on the Save button. Click on the app created and copy the Key (Client ID) and Secret (Client Secret) . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Bitbucket Account and update the scopes as added on Cobalt. Select the OAuth App created for Cobalt > Click on Edit in the Ellipsis button > Add the permissions as added in Cobalt > Click on Save . If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Bitbucket actions and triggers. Following are the set of Bitbucket actions and triggers supported by Cobalt. Actions Triggers Issues List Issues - List issues in Bitbucket. Create Issue - Create an issue in Bitbucket. Update Issue - Update an issue in Bitbucket. Project Create Project - Create a project in a workspace in Bitbucket. Delete Project - Delete a project for a workspace in Bitbucket. Update Project - Update a project for a workspace in Bitbucket. Workspaces List Workspaces - List workspaces for user in Bitbucket. Get Workspace By Id - Get a workspace in Bitbucket. Others HTTP Request - Make HTTP API calls to any Bitbucket documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Bitbucket Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}