{
    "url": "https://docs.gocobalt.io/resources/integration-providers/hibob",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation HiBob Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob Connect HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom HiBob Connect Connect with the Linked Account’s HiBob account. HiBob is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the HiBob integration, a Linked Account or an end-user will need to provide the following to connect: Service ID Service Token To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of HiBob To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your HiBob account . Go to Settings in the side menu and click on Integrations . Click on Connect or Manage in the Service Users card and create a new Service User. Enter a Service User Name and a Display Name > Click on Next > Copy the Service ID and Service Token displayed. Copy the Service Token as it will not be shown again. ​ Permissions for Service User By default, Service Users in HiBob are created with no access permissions/scopes and need to be added in a permission group with the relevant permissions. You need to create a specific permissions group for Service Users and add the service user to that group. ​ Create Permission group Go to Settings > Account > Permission Groups in your HiBob account. Click on + Add Permission Group > Provide a Group Name > Select Select people by condition in Group members > Click Select People . Delete the default Conditions given > Click on Add Specific Employees > Service Users > Select the Service Users > Click on Apply > Click Create . ​ Permissions in the Group In the Group, under Features tab, go to API Access and enable Manage REST API Token > Click on Save > Click on Apply . Also add other permissions which are required based on your Actions requirements. The Linked Account or end-user now have all the credentials required to connect with HiBob. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using HiBob actions and triggers. Following are the set of HiBob actions and triggers supported by Cobalt. Actions Triggers Employee Create Employee - Create a new user in HiBob. Get Employee - Get user by id in HiBob. Update Employee - Update user by id in HiBob. Delete Employee - Delete user by id in HiBob. Others HTTP Request - Make HTTP API calls to any HiBob documented REST APIs. Revoke Employee Access - Revoke access for an employee in HiBob. Complete Task - Mark a task as complete in HiBob. Upload Document To Employee Shared Folder - Upload a document to the employee’s shared folder in HiBob. Setup Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of HiBob Permissions for Service User Create Permission group Permissions in the Group Actions and triggers"
}