{
    "url": "https://docs.gocobalt.io/resources/integration-providers/sheets_overview#required-settings",
    "text": "Overview - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Google Sheets Overview Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Overview Setup Building a Google Sheets integration Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Google Sheets Overview Overview of the Google Sheets integration in Cobalt. ​ Basic Overview Slug google_sheets Authentication Method OAuth 2.0 Website https://www.google.com/sheets/about/ Developer Portal https://console.cloud.google.com/welcome/ API Reference https://developers.google.com/sheets/api/reference/rest Supported Resources Uni-directional, Syncs ​ Required Settings Credentials required Client ID Client Secret Scopes Learn how to create an OAuth app in Google Sheets here . Mandatory Scopes https://www.googleapis.com/auth/userinfo.email https://www.googleapis.com/auth/spreadsheets https://www.googleapis.com/auth/drive.readonly ​ Configurable Resources Spreadsheet Cobalt allows you to work with actions related to Spreadsheets. Worksheet Cobalt allows you to work with actions related to Worksheets. Setup Setup linkedin twitter Powered by Mintlify On this page Basic Overview Required Settings Configurable Resources"
}