{
    "url": "https://docs.gocobalt.io/resources/integration-providers/fireflies",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Fireflies.ai Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai Connect FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Fireflies.ai Connect Connect with the Linked Account’s Fireflies account. Fireflies is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Fireflies integration, a Linked Account or an end-user will need to provide the following to connect: API Key To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Fireflies To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Fireflies account . Go to the Integrations option in the side menu and search for Fireflies API card. Copy the API Key displayed under Settings section in the right. The Linked Account or end-user now have all the credentials required to connect with Fireflies. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Fireflies actions and triggers. Following are the set of Fireflies actions and triggers supported by Cobalt. Actions Triggers Audio Files Upload Audio - Upload an audio file in Fireflies. Users List users - List of users in Fireflies. Get User - Get a user by its ID in Fireflies. Others HTTP Request - Make HTTP API calls to any Fireflies documented REST APIs. Get Transcript - Get a transcript of a meeting by its ID in Fireflies. Setup Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Fireflies Actions and triggers"
}