{
    "url": "https://docs.gocobalt.io/resources/integration-providers/trello",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Trello Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Connect Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Trello Connect Connect with the Linked Account’s Trello account. Trello is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Trello integration, a Linked Account or an end-user will need to provide the following to connect: API Key API Token To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Trello To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Trello account and go to Power-Ups Admin page. Click on the Power-Ups under Apps in the side menu and click on New . Enter the Name , select Workspace , fill all the required fields and click on Create . Click on Generate a new API key > click on Generate API Key and copy the API Key . To get the API Token , you’ll have to generate it manually. Click on Token hyperlinked button under API Key section, Allow permissions and copy the Token displayed. The Linked Account or end-user now have all the credentials required to connect with Trello. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Trello actions and triggers. Following are the set of Trello actions and triggers supported by Cobalt. Actions Triggers Card Create Card - Create a new card in Trello. Update Card - Update a card in Trello. Delete Card - Delete a card in Trello. Add Comment to Card - Add a comment to a card in Trello. Update Comment on Card - Update a comment on a card in Trello. Board Create Board - Create a board in Trello. Add Member to Board - Add a member to a board in Trello. Others HTTP Request - Make HTTP API calls to any Trello documented REST APIs. Create List - Create a new list in Trello. Get Members of an Organization - Get members of an organization in Trello. Setup Connect linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Trello Actions and triggers"
}