{
    "url": "https://docs.gocobalt.io/resources/integration-providers/salesforce_overview",
    "text": "Overview - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Salesforce Overview Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Overview Setup Building a Salesforce integration Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Salesforce Overview Overview of the Salesforce integration in Cobalt. ​ Basic Overview Slug Salesforce Authentication Method OAuth 2.0 Website https://www.salesforce.com/ Developer Portal https://developer.salesforce.com/ API Reference Click here Supported Resources Bi-directional, Webhook Events, Syncs ​ Required Settings Credentials required Consumer Key Consumer Secret Scopes Learn how to create an OAuth app in Salesforce here . Mandatory Scopes Manager user data via APIs(api) Perform requests at any time (refresh_token, offline_access) App Settings Require Secret for Refresh Token Flow Enable Authorization Code and Credentials Flow Enable Token Exchange Flow Require Secret for Token Exchange Flow Issue JSON Web Token (JWT)-based access tokens for named users ​ Configurable Resources Account Cobalt allows you to work with actions and triggers related to Accounts. Contact Cobalt allows you to work with actions and triggers related to Contacts. Lead Cobalt allows you to work with actions and triggers related to Leads. Opportunity Cobalt allows you to work with actions and triggers related to Opportunities. Note Cobalt allows you to work with actions related to Notes. Setup Setup linkedin twitter Powered by Mintlify On this page Basic Overview Required Settings Configurable Resources"
}