{
    "url": "https://docs.gocobalt.io/resources/integration-providers/talkdesk",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Talkdesk Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Setup Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Talkdesk Setup Connect to your Talkdesk app for OAuth. To setup your Talkdesk app in Cobalt for OAuth, you will need the following credentials from your Talkdesk account : Client ID Client Secret Scopes ​ Pre-requisites Talkdesk account. To create an account, you need to apply for Talkdesk Partner program here . ​ Required Settings Mandatory Scopes account:read If you haven’t already created an app in Talkdesk, you’d need to create one. ​ Creating an app in Talkdesk To create a Talkdesk app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Talkdesk account . Click on the Builder icon in the side menu and select OAuth Clients option. Go to your Apps catalog in Cobalt > Search for Talkdesk > Settings > Use your credentials > Callback Url > Copy it. Click on New Oauth Client button in Talkdesk platform > Provide an OAuth Client Name > Select all 3 options under Grant Type > Paste the Callback Url under Redirect URI's . Select the mandatory scopes in the Selected scopes section, as provided in your Cobalt Talkdesk settings page and click on the Add Scopes button. Click on Create to complete the app creation. Copy the Client ID and Client Secret displayed. Ensure that the Client Secret is saved as it will be shown only once. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Talkdesk account and update the scopes as added on Cobalt. Select the OAuth App created for Cobalt > Click on Add scopes > Add the scopes as added in Cobalt > Click on Add Scopes and then Save Changes . If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Talkdesk actions and triggers. Following are the set of Talkdesk actions and triggers supported by Cobalt. Actions Triggers Campaigns List Campaigns - List all campaigns in Talkdesk. Cases List Cases - Get all cases in Talkdesk. Contacts List Contacts - Get all the contacts in Talkdesk. Get Contact By Id - Get contact By Id in Talkdesk. Delete Contact - Delete a contact in Talkdesk. Others HTTP Request - Make HTTP API calls to any Talkdesk documented REST APIs. Connect Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Talkdesk Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}