{
    "url": "https://docs.gocobalt.io/resources/integration-providers/netsuite_oauth",
    "text": "OAuth Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation NetSuite OAuth Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Key Based Connect OAuth Setup Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom NetSuite OAuth Setup Access to your users’ NetSuite record through OAuth. To setup your NetSuite app in Cobalt for OAuth, you will need the following credentials from your NetSuite account: Client ID Client Secret Account ID Scopes ​ Pre-requisites NetSuite account. OAuth Enabled in Netsuite. ​ Required Settings Mandatory Scopes rest_webservices suite_analytics If you haven’t already created an app in NetSuite, you’d need to create one. ​ Enable OAuth in NetSuite Before creating an app in NetSuite, you are required to enable OAuth. Follow the steps given below: Navigate to Setup > Company > Enable Features in your Netsuite account. Select the SuiteCloud tab present, scroll down and enable the following in your settings: SOAP Web Services (under SuiteTalk (Web Services) ) REST Web Services (under SuiteTalk (Web Services) ) SuiteSignon (under Manage Authentication ) OAuth 2.0 (under Manage Authentication ) ​ Creating an app in NetSuite To create a NetSuite app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Netsuite account with Admin permissions. To get your Account ID , navigate to Setup > Company > Company Information and copy the Account ID present there. Click on Setup > Integration > Manage Integrations and choose New . Enter the App Name and under Authentication > Token-based authentication , first uncheck the TBA: Authorization Flow and then Token based authentication . You are required to first uncheck the TBA: Authorization Flow checkbox as it cannot be disabled if the Token based authentication checkbox is disabled first. Go to your Apps catalog in Cobalt > Search for Netsuite > Settings > Use your credentials > Callback Url > Copy it. Paste the Callback Uri under Redirect URI field under OAuth 2.0 in the app. Select the mandatory scopes in the Scope section under OAuth 2.0 , as provided in your Cobalt Netsuite settings page and click on the Save button. Scroll down and copy the Client ID and Client Secret from the Client Credentials section. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Netsuite account and update the scopes as added on Cobalt. Select the OAuth App created for Cobalt > Click on Edit > Add the scopes as added in Cobalt > Click on Save . If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using NetSuite actions and triggers. Following are the set of NetSuite actions and triggers supported by Cobalt. Actions Triggers Accounts Get Accounts - Get all accounts in Netsuite. Create Account - Create a new account in Netsuite. Update Account - Update an account in Netsuite. Boms Get Boms - Get all Boms in Netsuite. Create Boms - Create a new Bom in Netsuite. Update Boms - Update an Bom in Netsuite. Get Bom by ID - Get a Bom by ID in Netsuite. Campaigns Create Campaign - Create a campaign in Netsuite. Get Campaigns - Get Campaign list in Netsuite. Update Campaign - Update a campaign in Netsuite. Delete Campaign - Delete a campaign in Netsuite. Contacts Create Contact - Create a contact in Netsuite. Get Contact - Get all contacts in Netsuite. Update Contact - Update a contact in Netsuite. Currency Get Currency - List all currencies in Netsuite. Create Currency - Create a currency in Netsuite. Get Currency By Id - Get a currency by ID in Netsuite. Update Currency - Update a currency in Netsuite. Customer Get Customers - Get all customers in Netsuite. Create Customer - Create a customer in Netsuite. Get Customer By Id - Get a customer by ID in Netsuite. Update Customer - Update a customer in Netsuite. Departments Get Departments - List all departments in Netsuite. Employees Get Employees - Get all employees in Netsuite. Create Employee - Create an employee in Netsuite. Update Employee - Update an employee in Netsuite. Delete Employee - Delete an employee in Netsuite. Inventory Items Get Inventory Item - Get all inventory items in Netsuite. Create Inventory Item - Create an inventory item in Netsuite. Update Inventory Item - Update an inventory item in Netsuite. Invoice * Get Invoices - Get all invoices in Netsuite. Opportunities Get Opportunities - Get all opportunities in Netsuite. Create Opportunity - Create an opportunity in Netsuite. Update Opportunity - Update an opportunity in Netsuite. Delete Opportunity - Delete an opportunity in Netsuite. Sales Record Get Sales Record - Get all sales records in Netsuite. Create Create Sales Record - Create a sales record in Netsuite. Get Sales Record By Id - Get a Sales record by ID in Netsuite. Update Sales Record - Update sales record in Netsuite. Subsidiary Get Subsidiary - Get all subsidiaries in Netsuite. Get Subsidiary By Id - Get a subsidiary by ID in Netsuite. Tasks Create Task - Create a task in Netsuite. Get Tasks - Get all tasks in Netsuite. Update Task - Update task in Netsuite. Delete Task - Delete task in Netsuite. Timesheets Get Timesheets - Get all Timesheets in Netsuite. Vendors Create Vendor - Create a vendor in Netsuite. Delete Vendor - Delete a vendor in Netsuite. Others HTTP Request - Make HTTP API calls to any NetSuite documented REST APIs. Key Based Connect Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Enable OAuth in NetSuite Creating an app in NetSuite Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}