{
    "url": "https://docs.gocobalt.io/resources/integration-providers/highlevel",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation HighLevel Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Setup Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom HighLevel Setup Connect to your HighLevel app for OAuth. To setup your HighLevel app in Cobalt for OAuth, you will need the following credentials from your HighLevel Marketplace account : Client ID Client Secret Scopes ​ Pre-requisites Highlevel Marketplace account. You can create one here . ​ Required Settings Mandatory Scopes oauth.readonly oauth.write If you haven’t already created an app in HighLevel, you’d need to create one. ​ Creating an app in HighLevel To create a HighLevel app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your HighLevel Marketplace account . Click on the My Apps tab in the top nav bar and click on + Create App button. Enter the App Name , choose App Type as Private , check Agency and Sub-account in Distribution type , choose White-label under Listing Type and click on Create App . Go to your Apps catalog in Cobalt > Search for High Level > Settings > Use your credentials > Callback Url > Copy it. Go to Settings in the left menu, scroll down to Redirect URLs and paste the copied Callback Url, click on + Add and click on the Save button. Select the mandatory scopes in the Scopes section, as provided in your Cobalt HighLevel settings page and click on the Save button. Scroll down to the Client Keys section in Settings , click on + Add button and give it a Name . Copy the Client ID and Client Secret displayed. Copy the Credentials now as the Client Secret will not be visible again. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your HighLevel Marketplace account and update the scopes as added on Cobalt. Select the OAuth App created for Cobalt > Click on Settings in side menu > Add the scopes as added in Cobalt under Scopes section > Click on Save . If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ HighLevel Single Webhook URL To get the User Events through Webhooks in High Level, the OAuth app needs to be submitted for review and published. If you wish to create an orchestration where a workflow is being triggered when some operation occurs in High Level, you’d need to subscribe to High Level’s Webhook. Cobalt provides a single webhook URL to manage such event triggers for all your customers. To setup High Level webhook subscription: Select High Level from the application list in Cobalt , and select Settings . Copy the Single Webhook Url Go to My Apps > Choose your OAuth app > Settings > Webhooks . Subscribe to the events for which you want to configure the Webhooks. Webhook Events will be disabled in High Level app if the appropriate scopes are not added to the OAuth app. Scroll down, paste the Single Webhook Url inside the Webhook URL section and click on Save . To learn more about how to listen to Webhook Events in HighLevel, refer here . ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using High Level actions and triggers. Following are the set of High Level actions and triggers supported by Cobalt. Actions Triggers Contact Create Contact - Create a contact in High Level. Update Contact - Update a contact in High Level. Delete Lead - Delete a contact in High Level. Upsert Contact - Upsert a contact in High Level. List Contacts - List contacts in High Level. Note Create Note - Create a note in High Level. Update Note - Update a note in High Level. Opportunity Create Opportunity - Create an opportunity in High Level. Update Opportunity - Update an opportunity in High Level. Search Opportunity - Search Opportunities in High Level. Task Create Task - Create a task in High Level. Update Task - Update a tas in High Level. List Tasks - List tasks in High Level. Others HTTP Request - Make HTTP API calls to any High Level documented REST APIs. Connect Overview linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in HighLevel Configuring credentials in Cobalt Configuring Scopes HighLevel Single Webhook URL Actions and triggers"
}