{
    "url": "https://docs.gocobalt.io/resources/integration-providers/ms_dynamics_crm",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Microsoft Dynamics CRM Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Setup Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Microsoft Dynamics CRM Setup Connect to your Microsoft Dynamics CRM app for OAuth. To setup your Microsoft Dynamics CRM app in Cobalt for OAuth, you will need the following credentials from your Microsoft Azure account : Client ID Client Secret Scopes ​ Pre-requisites Microsoft Azure Account. You can create one here . If you haven’t already created an app in Microsoft Azure, you’d need to create one. ​ Creating an app in Microsoft Azure To create a Microsoft Dynamics CRM app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Microsoft Azure account . Search for Microsoft Entra ID and select it from Services in the top search bar. Navigate to Overview in the side menu > Click on +Add > Select App Registration . Enter the App Name for your application and select Accounts in any organizational directory (Any Microsoft Entra ID tenant - Multitenant) under Supported Account Types . Go to your Apps catalog in Cobalt > Search for Ms Dynamics CRM > Settings > Use your credentials > Callback Url > Copy it. Under the Redirect URI section, select Platform as Web , paste the Callback Url as the URL and click Register . If you already have an app created, then follows these steps to add Redirect URL: Select your Application > Select Authentication in side menu > Under Platform configurations , press the Add a platform button > Select Web > Paste the Callback Url > Click on Configure > Click Save button at the bottom. Navigate to Manage > API permissions in the side menu > Click on + Add a permission . Choose the Dynamics CRM card under Microsoft APIs > Choose Application permissions > Select the scopes that you require > click on the Add Permissions button. Navigate to Certificates and Secrets in the side menu and under Client Secrets tab, press the + New client secret button. Give a Description , select the best expiry for your application and click Add to create your credentials. Copy the displayed Client Secret under the Value column. Navigate to Overview in the side menu > Essentials tab > Copy the Client ID under Application (client) ID . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Microsoft Dynamics CRM actions and triggers. Following are the set of Microsoft Dynamics CRM actions and triggers supported by Cobalt. Actions Triggers Lead Get Leads - Get all leads in Microsoft Dynamics CRM. Create Lead - Create Lead in Microsoft Dynamics CRM. Update Lead - Update Lead in Microsoft Dynamics CRM. Delete Lead - Delete Lead in Microsoft Dynamics CRM. Contact Get Contacts - Get all contacts in Microsoft Dynamics CRM. Create Contact - Create Contact in Microsoft Dynamics CRM. Update Contact - Update Contact in Microsoft Dynamics CRM. Delete Contact - Delete Contact in Microsoft Dynamics CRM. Opportunity Get Opportunities - Get all opportunities in Microsoft Dynamics CRM. Create Opportunity - Create Opportunity in Microsoft Dynamics CRM. Update Opportunity - Update Opportunity in Microsoft Dynamics CRM. Delete Opportunity - Delete Opportunity in Microsoft Dynamics CRM. Account Get Accounts - Get all accounts in Microsoft Dynamics CRM. Create Account - Create Account in Microsoft Dynamics CRM. Update Account - Update Account in Microsoft Dynamics CRM. Delete Account - Delete Account in Microsoft Dynamics CRM. Others HTTP Request - Make HTTP API calls to any Microsoft Dynamics CRM documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Microsoft Azure Configuring credentials in Cobalt Actions and triggers"
}