{
    "url": "https://docs.gocobalt.io/resources/integration-providers/netsuite",
    "text": "Key Based Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation NetSuite Key Based Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Key Based Connect OAuth Setup Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom NetSuite Key Based Connect Connect with the Linked Account’s NetSuite account. NetSuite is an API Key based integration and does not require the setup of an app. ​ Pre-requisites NetSuite account. Token Based Auth Enabled in Linked Account’s Netsuite. ​ Required Credentials of a Linked Account To successfully connect with the NetSuite integration, a Linked Account or an end-user will need to provide the following to connect: Account ID Consumer Key Consumer Secret Token ID Token Secret ​ Enable Token Based Auth in NetSuite Before creating the credentials in NetSuite, you are required to enable Token Based Auth. Follow the steps given below: Navigate to Setup > Company > Enable Features in your Netsuite account. Select the SuiteCloud tab present, scroll down and enable Token-Based Authentication checkbox under Manage Authentication section. ​ Getting Credentials of NetSuite To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Netsuite account with Admin permissions. To get your Account ID , navigate to Setup > Company > Company Information and copy the Account ID present there. Click on Setup > Integration > Manage Integrations and choose New . Enter the App Name and under Authentication , uncheck the TBA: Authorization Flow under Token-based authentication and then disable Authorization Code Grant checkbox under OAuth 2.0 . Click on Save and copy the Consumer Key and Consumer Secret displayed under Client Credentials section. Navigate to Dashboard and click on Manage Access Tokens under Settings in the side menu. Click on New My Access Token > Select the Integration created above from the Application Name drop-down > Provide a Token Name and click on Save . Ensure that you selected the correct app in the Application Name drop-down. Copy the Token ID and Token Secret displayed under Token Id/Secret section. The Linked Account or end-user now have all the credentials required to connect with NetSuite. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using NetSuite actions and triggers. Following are the set of NetSuite actions and triggers supported by Cobalt. Actions Triggers Accounts Get Accounts - Get all accounts in Netsuite. Create Account - Create a new account in Netsuite. Update Account - Update an account in Netsuite. Boms Get Boms - Get all Boms in Netsuite. Create Boms - Create a new Bom in Netsuite. Update Boms - Update an Bom in Netsuite. Get Bom by ID - Get a Bom by ID in Netsuite. Campaigns Create Campaign - Create a campaign in Netsuite. Get Campaigns - Get Campaign list in Netsuite. Update Campaign - Update a campaign in Netsuite. Delete Campaign - Delete a campaign in Netsuite. Contacts Create Contact - Create a contact in Netsuite. Get Contact - Get all contacts in Netsuite. Update Contact - Update a contact in Netsuite. Currency Get Currency - List all currencies in Netsuite. Create Currency - Create a currency in Netsuite. Get Currency By Id - Get a currency by ID in Netsuite. Update Currency - Update a currency in Netsuite. Customer Get Customers - Get all customers in Netsuite. Create Customer - Create a customer in Netsuite. Get Customer By Id - Get a customer by ID in Netsuite. Update Customer - Update a customer in Netsuite. Departments Get Departments - List all departments in Netsuite. Employees Get Employees - Get all employees in Netsuite. Create Employee - Create an employee in Netsuite. Update Employee - Update an employee in Netsuite. Delete Employee - Delete an employee in Netsuite. Inventory Items Get Inventory Item - Get all inventory items in Netsuite. Create Inventory Item - Create an inventory item in Netsuite. Update Inventory Item - Update an inventory item in Netsuite. Invoice * Get Invoices - Get all invoices in Netsuite. Opportunities Get Opportunities - Get all opportunities in Netsuite. Create Opportunity - Create an opportunity in Netsuite. Update Opportunity - Update an opportunity in Netsuite. Delete Opportunity - Delete an opportunity in Netsuite. Sales Record Get Sales Record - Get all sales records in Netsuite. Create Create Sales Record - Create a sales record in Netsuite. Get Sales Record By Id - Get a Sales record by ID in Netsuite. Update Sales Record - Update sales record in Netsuite. Subsidiary Get Subsidiary - Get all subsidiaries in Netsuite. Get Subsidiary By Id - Get a subsidiary by ID in Netsuite. Tasks Create Task - Create a task in Netsuite. Get Tasks - Get all tasks in Netsuite. Update Task - Update task in Netsuite. Delete Task - Delete task in Netsuite. Timesheets Get Timesheets - Get all Timesheets in Netsuite. Vendors Create Vendor - Create a vendor in Netsuite. Delete Vendor - Delete a vendor in Netsuite. Others HTTP Request - Make HTTP API calls to any NetSuite documented REST APIs. Setup OAuth Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Credentials of a Linked Account Enable Token Based Auth in NetSuite Getting Credentials of NetSuite Actions and triggers"
}