{
    "url": "https://docs.gocobalt.io/resources/integration-providers/gusto",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Gusto Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Setup Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Gusto Setup Connect to your Gusto app for OAuth. Cobalt offers both Key Based and OAuth 2.0 integration for Gusto. In this guide, we will look at the OAuth App setup process. To setup your Gusto app in Cobalt for OAuth, you will need the following credentials from your Gusto Developer account : Client ID Client Secret Scopes ​ Pre-requisites Gusto Developer account. You can create one here . If you haven’t already created an app in Gusto, you’d need to create one. ​ Creating an app in Gusto To create a Gusto app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Gusto Developer account . Click on the Applications icon in the side menu. Go to your Apps catalog in Cobalt > Search for Gusto > Settings > Use your credentials > Callback Url > Copy it. Click on + Create application button in the right, enter the App Name , paste the Callback Url under Redirect URI , select a Category and click on Create . Go to the App Details tab > Scroll down > Copy the Client ID and Secret . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. To get access to your Production Credentials for Gusto App, you need to submit app for review to Gusto. Learn more about the Review and it’s requirements here . ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Gusto actions and triggers. Following are the set of Gusto actions and triggers supported by Cobalt. Actions Triggers Employee List Employees - Get all employees in Gusto. Create Employee - Create an employee in Gusto. Payroll List Payrolls - Get all payrolls in Gusto. Prepare a Payroll for Update - Prepare a payroll for update in Gusto. Get Payroll by ID - Get a payroll by ID in Gusto. Update Payroll By Id - Update a payroll by id in Gusto. Others HTTP Request - Make HTTP API calls to any Gusto documented REST APIs. Building a Google Sheets integration Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Gusto Configuring credentials in Cobalt Actions and triggers"
}