{
    "url": "https://docs.gocobalt.io/resources/integration-providers/intercom",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Intercom Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Setup Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Intercom Setup Connect to your Intercom app for OAuth. To setup your Intercom app in Cobalt for OAuth, you will need the following credentials from your Intercom Developer Hub : Client ID Client Secret Scopes ​ Pre-requisites Intercom Developer Hub account. ​ Required Settings Mandatory Scopes Read admins If you haven’t already created an app in Intercom, you’d need to create one. ​ Creating an app in Intercom To create a Intercom app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Intercom Developer Hub . Click on the Your Apps option in the top navbar. Click on New app button, give the App Name , select the Workspace and click on the Create App button. Go to your Apps catalog in Cobalt > Search for Intercom > Settings > Use your credentials > Callback Url > Copy it. Navigate to Authentication under Configure in the side menu > click on Edit in the right > Tick the Use OAuth option > Click on + Add redirect URL > Paste the Callback Url. In the same page, select the mandatory scopes in the Permissions section and click on the Save button. To access your customer’s Intercom data using OAuth, you will need to submit your app for review and make it a public-facing integration. Learn more about App publishing here . Navigate to the Basic information option in the side menu and copy the Client ID and Client Secret displayed. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth2 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Intercom Developer Hub and update the scopes as added on Cobalt. Select the OAuth App created for Cobalt > Click on Authentication under Configure > Click on Edit > Add the scopes as added in Cobalt > Click on Save . If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Intercom actions and triggers. Following are the set of Intercom actions and triggers supported by Cobalt. Actions Triggers Companies List Companies - Get all companies in Intercom. Create Company - Creates a company in Intercom. Update Company - Updates a company in Intercom. Conversations List Conversations - Gets a list of conversations in Intercom. Create Conversation - Creates a conversation in Intercom. Update Conversation - Updates a conversation in Intercom. Reply Conversation - Replies to a conversation in Intercom. Tags List Tags - Gets a list of tags in Intercom. Create Tag - Creates a tag in Intercom. Add Tag to Ticket - Add tag to a ticket in Intercom. Tickets Create Ticket - Creates a ticket in Intercom. Update Ticket - Updates a ticket in Intercom. Search Ticket - Searches a ticket based on the search parameter in Intercom. Others HTTP Request - Make HTTP API calls to any Intercom documented REST APIs. Building a HubSpot integration Connect linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Intercom Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}