{
    "url": "https://docs.gocobalt.io/resources/integration-providers/getresponse",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation GetResponse Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse Setup GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom GetResponse Setup Connect to your GetResponse app for OAuth. Cobalt offers both Key Based and OAuth 2.0 integration for GetResponse. In this guide, we will look at the OAuth App setup process. To setup your GetResponse app in Cobalt for OAuth, you will need the following credentials from your GetResponse account : Client ID Client Secret ​ Pre-requisites GetResponse account. You can create one here . If you haven’t already created an app in GetResponse, you’d need to create one. ​ Creating an app in GetResponse To create a GetResponse app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your GetResponse account . Click on the Tools icon in the top left > Select Integrations and API button and select Custom apps tab. Go to your Apps catalog in Cobalt > Search for GetResponse > Settings > Use your credentials > Callback Url > Copy it. Click on Add new app button in GetResponse platform > Provide Application name and Description > Paste the Callback Url under Redirect URL and click on Add . Click on the App created and copy the Client ID and Client Secret Key displayed. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ GetResponse Single Webhook URL If you wish to create an orchestration where a workflow is being triggered when some operation occurs in GetResponse, you’d need to subscribe to GetResponse’s Webhook. Cobalt provides a single webhook URL to manage such event triggers for all your customers. To setup GetResponse webhook subscription: Select GetResponse from the application list in Cobalt > select Settings and copy the Single Webhook Url . Navigate to Tools > Webhooks in GetResponse platform and click on Create Webhook . Provide a Webhook name > Paste the Single Webhook Url inside the Webhook URL field > select the relevant events in Which event to notify you of? > Change Status toggle to Active and click on Create webhook . ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using GetResponse actions and triggers. Following are the set of GetResponse actions and triggers supported by Cobalt. Actions Triggers Campaigns List Campaigns - List all campaigns in GetResponse. Create Campaign - Create a campaign in GetResponse. Update Campaign - Update a campaign in GetResponse. Contacts List Contacts - List all contacts in GetResponse. Create Contact - Create a new contact in GetResponse. Update Contact - Update a contact in GetResponse. Get Contact by ID - Get a contact by ID in GetResponse. Tags Create Tag - Create a tag in GetResponse. Update Tag - Update a Tag in GetResponse. Others HTTP Request - Make HTTP API calls to any GetResponse documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in GetResponse Configuring credentials in Cobalt GetResponse Single Webhook URL Actions and triggers"
}