{
    "url": "https://docs.gocobalt.io/resources/integration-providers/keap",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Keap Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Setup Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Keap Setup Connect to your Keap app for OAuth. To setup your Keap app in Cobalt for OAuth, you will need the following credentials from your Keap Developer account : Client ID Client Secret Scopes ​ Pre-requisites Keap Developer account. You can create one here . If you haven’t already created an app in Keap, you’d need to create one. ​ Creating an app in Keap To create a Keap app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Keap Developer account . Click on the Username in the top right and select Apps button. Click on + New App button in the top right. Enter the App Name for your application, click on Enable button under APIs section and click on Save . Navigate to API Keys section and copy the Key ( Client ID ) and Secret ( Client Secret ). ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth2 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, the app will now request for access of the mentioned scopes. If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Keap actions and triggers. Following are the set of Keap actions and triggers supported by Cobalt. Actions Triggers Contact Create Contact - Create a new contact in Keap. Create Or Update Contact - Create or Update a Contact in Keap. Update Contact - Update a contact in Keap. Get Contact By Id - Get contact by its ID in Keap. Retrieve Contact Model - Get the custom fields and optional properties for the Contact object in Keap. Note Create Note - Create a new note in Keap. Custom Field Create Custom Field - Create a new custom field in Keap. Opportunity Create Opportunity - Create a new opportunity in Keap. Update Opportunity - Update an opportunity in Keap. Tag List Tags - List tags in Keap. Create Tag - Create a new tag in Keap. Others HTTP Request - Make HTTP API calls to any Keap documented REST APIs. Add Tag To Contact - Add a tag to a contact in Keap. Building a Jira integration Connect linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Keap Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}