{
    "url": "https://docs.gocobalt.io/resources/integration-providers/zettle",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Zettle Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Setup Zoho Books Zoho CRM Zoom Zettle Setup Connect to your Zettle app for OAuth. To setup your Zettle app in Cobalt for OAuth, you will need the following credentials from your Zettle Developer account : Client ID Client Secret Scopes ​ Pre-requisites Zettle Developer account. You can create one here . ​ Required Settings Mandatory Scopes READ:USERINFO If you haven’t already created an app in Zettle, you’d need to create one. ​ Creating an app in Zettle To create a Zettle app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Zettle Developer account Dashboard. Click on Create new app credentials and select Public API Credentials button. Go to your Apps catalog in Cobalt > Search for Zettle > Settings > Use your credentials > Callback Url > Copy it. Provide the App name , App URL , Company Name and paste the Callback Url copied in OAuth Redirect URIs field. Click on Create credentials . Copy the Client ID and Client Secret from the API app Credentials section. Ensure that the Client secret is saved as it will be shown only once. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, the app will now request for access of the mentioned scopes. If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Zettle actions and triggers. Following are the set of Zettle actions and triggers supported by Cobalt. Actions Triggers Inventory List Inventories - List all inventories in Zettle. Create Inventory - Create new inventory in Zettle. Update Inventory Balance - Update an inventory balance in Zettle. Products List Products - List all products in Zettle. Create Product - Create new product in Zettle. Update Product - Update a product in Zettle. Purchases List Purchases - List all purchases in Zettle. Get Purchase by ID - Get a purchase by ID in Zettle. Others HTTP Request - Make HTTP API calls to any Zettle documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Zettle Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}