{
    "url": "https://docs.gocobalt.io/resources/integration-providers/capsule",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Capsule CRM Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Setup Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Capsule CRM Setup Connect to your Capsule CRM app for OAuth. To setup your Capsule app in Cobalt for OAuth, you will need the following credentials from your Capsule Developer account : Client ID Client Secret Scopes ​ Pre-requisites Capsule Developer account. You can create one through GitHub here . ​ Required Settings Mandatory Scopes read write If you haven’t already created an app in Capsule CRM, you’d need to create one. ​ Creating an app in Capsule To create a Capsule app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Capsule Developer account . Click on the New Application button in Your Apps section. Go to your Apps catalog in Cobalt > Search for Capsule CRM > Settings > Use your credentials > Callback Url > Copy it. Enter the App Name and Description > Paste the Callback Url under Redirect URL > Provide a Contact Email > Choose Web Application as Application Type and click on Save . Copy the Client ID and Client Secret displayed in the App. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Capsule CRM actions and triggers. Following are the set of Capsule CRM actions and triggers supported by Cobalt. Actions Triggers Entry Create Entry - Create a new entry in Capsule CRM. Update Entry - Update an entry in Capsule CRM. Delete Entry - Delete an entry in Capsule CRM. Opportunity Create Opportunity - Create a new opportunity in Capsule CRM. Update Opportunity - Update an opportunity in Capsule CRM. Delete Opportunity - Delete an opportunity in Capsule CRM. Party Create Party - Create a new party in Capsule CRM. Update Party - Update a party in Capsule CRM. Delete Party - Delete a party in Capsule CRM. Project Create Project - Create a new project in Capsule CRM. Update Project - Update a project in Capsule CRM. Delete Project - Delete a project in Capsule CRM. Organization Create Task - Create a new taskn in Capsule CRM. Update Task - Update a task in Capsule CRM. Delete Task - Delete a task in Capsule CRM. Others HTTP Request - Make HTTP API calls to any Capsule CRM documented REST APIs. Setup Connect linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Capsule Configuring credentials in Cobalt Actions and triggers"
}