{
    "url": "https://docs.gocobalt.io/resources/integration-providers/adobesign",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Adobe Sign Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Setup Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Adobe Sign Setup Connect to your Adobe Sign app for OAuth. To setup your Adobe Sign app in Cobalt for OAuth, you will need the following credentials from your Adobe Sign account : Client ID Client Secret Scopes ​ Pre-requisites Adobe Developer account. You can create one here . ​ Required Settings Mandatory Scopes user_read user_write user_login If you haven’t already created an app in Adobe Sign, you’d need to create one. ​ Creating an app in Adobe Sign To create a Adobe Sign app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Adobe Sign account . Click on the Account option in the top nav bar, select Acrobat Sign API in the side menu and choose API Applications . Click on + button in the top right > provide a Name and Display Name for your app > Choose Partner as Domain and click on Save . Go to your Apps catalog in Cobalt > Search for Adobe Sign > Settings > Use your credentials > Callback Url > Copy it. Select the app created, click on Configure OAuth for application and paste the Callback Url under Redirect URI field. Select the mandatory scopes in the Enabled scopes section, as provided in your Cobalt Adobe Sign settings page and click on the Save button. Click on View/Edit option for the app and copy the Application ID (Client ID) and Client Secrets Value (Client Secret) . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Adobe Sign account and update the scopes as added on Cobalt. Select the OAuth App created for Cobalt > Click on Configure OAuth for Application > Add the scopes as added in Cobalt > Click on Save . If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ Getting OAuth App Partner Certified In Adobe, Partner applications will not have full access to other accounts until they have been Certified. To get your app certified, you need to complete few steps with the Adobe Team. To get app certified and fill the required details, refer here . ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Adobe Sign actions and triggers. Following are the set of Adobe Sign actions and triggers supported by Cobalt. Actions Triggers Agreements List Agreements - Retrieves agreements for the user in Adobe Sign. Create Agreement - Creates an agreement in Adobe Sign. Update Agreement - Updates an agreement in Adobe Sign. Search Agreement - Searches, filters, and sorts agreements for the user in Adobe Sign. Get an agreement by ID - Gets a specific agreement by ID in Adobe Sign. Users List Users - Retrieves all the users in an account in Adobe Sign. Create User - Creates a new user in Adobe Sign. Update User - Updates a user in Adobe Sign. Others HTTP Request - Make HTTP API calls to any Adobe Sign documented REST APIs. List Events for a User - Retrieves all events for user in Adobe Sign. Send Agreement for Sign - Send an agreement out for signature to multiple recipients in Adobe Sign. Overview Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Adobe Sign Configuring credentials in Cobalt Configuring Scopes Getting OAuth App Partner Certified Actions and triggers"
}