{
    "url": "https://docs.gocobalt.io/resources/integration-providers/zendesk_crm",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Zendesk Sell Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Setup Zettle Zoho Books Zoho CRM Zoom Zendesk Sell Setup Connect to your Zendesk Sell app for OAuth. Cobalt offers both Key Based and OAuth 2.0 integration for Zendesk Sell. In this guide, we will look at the OAuth App setup process. To setup your Zendesk Sell app in Cobalt for OAuth, you will need the following credentials from your Zendesk Sell Developer Console : Client ID Client Secret ​ Pre-requisites Zendesk Sell Developer account. You can create one here . If you haven’t already created an app in Zendesk Sell, you’d need to create one. ​ Creating an app in Zendesk Sell To create a Zendesk Sell app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Zendesk Sell Developer Console . Click on the Settings icon in the side menu and select OAuth under Integrations section. Go to Developer Apps tab and click + Add Developer App button. Go to your Apps catalog in Cobalt > Search for Zendesk CRM > Settings > Use your credentials > Callback Url > Copy it. In the app, Add Application Name , Description and Website and paste the Callback Url under Redirect URL field. Click on Save . Click on Details and copy the Client ID and Client Secret from the Credentials section. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, the app will now request for access of the mentioned scopes. If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Zendesk Sell actions and triggers. Following are the set of Zendesk Sell actions and triggers supported by Cobalt. Actions Triggers Lead Create Lead - Create a lead in Zendesk Sell. Update Lead - Update a lead in Zendesk Sell. Delete Lead - Delete a lead in Zendesk Sell. Contact Create Contact - Create a new contact in Zendesk Sell. Update Contact - Update a contact in Zendesk Sell. Delete Contact - Delete a contact in PZendesk Sell. Deal Create Deal - Create a new deal in Zendesk Sell. Update Deal - Update a deal in Zendesk Sell. Delete Deal - Delete a deal in Zendesk Sell. Organization Create Organization - Create an organization in Zendesk Sell. Update Organization - Update an organization in Zendesk Sell. Delete Organization - Delete an Organization in Zendesk Sell. Others HTTP Request - Make HTTP API calls to any Zendesk Sell documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Zendesk Sell Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}