{
    "url": "https://docs.gocobalt.io/resources/integration-providers/workable#getting-credentials-of-workable",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Workable Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Connect Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Workable Connect Connect with the Linked Account’s Workable account. Workable is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Workable integration, a Linked Account or an end-user will need to provide the following to connect: Base URL Access Token To understand how a Linked Account can get the above mentioned credentials, refer here . ​ Getting Credentials of Workable To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Workable account and copy the Base URL of your account. Click on the Profile icon in the top right and select Settings . Navigate to Integrations > Apps in the side menu > Scroll down to API Access Tokens section > Click on Generate API Token button. Enter the Name , Expiry depending on your use case, select the API Scopes and click on Generate Token . Copy the Access Token displayed. The Linked Account or end-user now have all the credentials required to connect with Workable. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Workable actions and triggers. Following are the set of Workable actions and triggers supported by Cobalt. Actions Triggers Candidate Create a Candidate - Create a candidate in Workable. Note Create a Note/Comment - Create a Note/Comment in Workable. Others HTTP Request - Make HTTP API calls to any Workable documented REST APIs. Connect Connect linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Workable Actions and triggers"
}