{
    "url": "https://docs.gocobalt.io/resources/integration-providers/workday",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Workday Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Connect Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Workday Connect Connect with the Linked Account’s Workday account. Workday is a Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Workday integration, a Linked Account or an end-user will need to provide the following to connect: Sub-Domain Tenant Username Password You need Workday Admin permissions to view Sub Domain. ​ Getting Credentials of Workday To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Workday account as an Admin and search for View API Clients . In the Workday REST API Endpoint , you can find the Sub-Domain and Tenant which will be in the format where Sub-Domain is the string between https:// and .workday.com and Tenant is the string at the end of the Endpoint after /v1/ . Username and Password are the credentials with which you login into your Workday Environment. The Linked Account or end-user now have all the credentials required to connect with Workday. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Workday actions and triggers. Following are the set of Workday actions and triggers supported by Cobalt. Actions Triggers Applicants Create/Update Applicant - Creates or updates an applicant in Workday. Get Applicants - Returns public and private information for specified applicants in Workday. Compensations Create/Update Compensation Plan - Allows the creation or update of a compensation plan in Workday. Get Compensation Plans - Allows the retrieval of detailed compensation plan information in Workday. Journals Get Journals - Returns public and private information for specified journals in Workday. Organizations Get Organizations - Returns public and private information for specified organizations in Workday. Payments List Payments - Returns Payments Info for the specified criteria in Workday. Position Create Position - Creates a new position in Workday. Get Positions - Returns public and private information for specified positions in Workday. Workers Get Workers - Returns public and private information for specified workers in Workday. Signon Get Valid Signon - Returns info about valid signons in Workday. Others HTTP Request - Make HTTP API calls to any Workday documented APIs. Connect Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Workday Actions and triggers"
}