{
    "url": "https://docs.gocobalt.io/resources/integration-providers/aircall",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Aircall Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Connect Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Aircall Connect Connect with the Linked Account’s Aircall account. Aircall is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Aircall integration, a Linked Account or an end-user will need to provide the following to connect: API ID API Token To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Aircall To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Aircall account . Click on the Integrations & API in the side menu and click on API Keys tab. Click on Generate an API key and enter a Key name . Copy the API ID and API Token displayed and click on Confirm . Copy the API token as it won’t be visible again. The Linked Account or end-user now have all the credentials required to connect with Aircall. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Aircall actions and triggers. Following are the set of Aircall actions and triggers supported by Cobalt. Actions Triggers Call Start Outbound Call - Start an outbound call for a User from their Phone app. The User must be available, not on a call, and associated with the Number to be used for the call. Contact Create Contact - Create a new Contact that will be automatically shared across the company in Aircall. Update Contact - Update a shared Contact and get the updated Contact as the response in Aircall. Delete Contact - Delete a shared Contact from the Company in Aircall. Others HTTP Request - Make HTTP API calls to any Aircall documented REST APIs. Connect Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Aircall Actions and triggers"
}