{
    "url": "https://docs.gocobalt.io/resources/integration-providers/tableau",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Tableau Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Connect Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Tableau Connect Connect with the Linked Account’s Tableau account. Tableau is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Tableau integration, a Linked Account or an end-user will need to provide the following to connect: Base URL Access Token Access Token Name To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Tableau To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Tableau account and copy the Base URL of your account before /# in the URL. Click on the Settings icon in the side menu > Go to General tab > Scroll down and check that Enable personal access tokens is checked. Click on Profile Icon in the top right corner and select My Account Settings . Under Settings tab > Scroll to Personal Access Tokens section > Provide a Token Name and click on Create Token . Copy the Token Name and Token Secret displayed which is the Access Token. The Linked Account or end-user now have all the credentials required to connect with Tableau. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Tableau actions and triggers. Following are the set of Tableau actions and triggers supported by Cobalt. Actions Triggers Refresh Tasks List Extract Refresh Tasks in Site - Returns a list of extract refresh tasks for the site in Tableau. Run Extract Refresh Task - Runs the specified extract refresh task in Tableau. Sites List Sites - Returns a list of the sites in Tableau. Create Site -Creates a site on Tableau Server. View Download View Crosstab in Excel - Downloads view crosstab in Excel in Tableau. Search View - Returns all the views for the specified site in Tableau. Workbook Search Workbook - Returns the workbooks on a site in Tableau. Others HTTP Request - Make HTTP API calls to any Tableau documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Tableau Actions and triggers"
}