{
    "url": "https://docs.gocobalt.io/resources/integration-providers/attio",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Attio Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio Setup AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Attio Setup Connect to your Attio app for OAuth. To setup your Attio app in Cobalt for OAuth, you will need the following credentials from your Attio Developer Settings : Client ID Client Secret Scopes ​ Pre-requisites Attio account. You can create one here . If you haven’t already created an app in Attio, you’d need to create one. ​ Creating an app in Attio To create a Attio app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Attio Account . Click on the Company name in the top left corner and select Workspace Settings option. Go to Developers under Workspace in the side menu and click on Create a new integration button. Enter the Integration Name for your application and click on Create . Go to your Apps catalog in Cobalt > Search for Attio > Settings > Use your credentials > Callback Url > Copy it. Go to OAuth in the App > Toggle on OAuth Enabled option > Click on + add new Redirect URI > Paste the Callback URL and click on Add Redirect URI . Copy the Client ID and Client Secret from the OAuth section. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Attio Developer Settings and update the scopes as added on Cobalt. Select the OAuth App created for Cobalt > Click on Scopes section > Add the scopes as added in Cobalt. If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ App Review for Attio The integration is currently private and only usable by your workspace. To distribute your integration for use in other workspaces, you need to request a review from Attio team. Go to Publication section in the OAuth app and click on Request publication . Before requesting the publication of your app, make sure to add all the information like App name, description, scopes and logo of the app. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Attio actions and triggers. Following are the set of Attio actions and triggers supported by Cobalt. Actions Triggers Person List Person - Lists person records, with the option to filter and sort results in Attio. Create Person - Creates a new person record in Attio. Update Person - Update a person record in Attio. Delete Person - Delete a person record in Attio. Deals Create Deal - Create a deal record in Attio. Update Deal - Update a deal record in Attio. Delete Deal - Delete a deal record in Attio. Get Deal - Get a deal record in Attio. Company Update Company - Update a company record in Attio. Create Company - Create a company record in Attio. List Company - List company records, with the option to filter and sort results in Attio. Notes Create Note - Create a note in Attio. Get Note - Get a note in Attio. Others HTTP Request - Make HTTP API calls to any Attio documented REST APIs. Setup Connect linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Attio Configuring credentials in Cobalt Configuring Scopes App Review for Attio Actions and triggers"
}