{
    "url": "https://docs.gocobalt.io/resources/integration-providers/salesforce_finance",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Salesforce Financial Services Cloud Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Setup Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Salesforce Financial Services Cloud Setup Connect to your Salesforce Financial Services Cloud app for OAuth. To setup your Salesforce Financial Services Cloud app in Cobalt for OAuth, you will need the following credentials from your Salesforce Financial Services Cloud account: Client ID Client Secret Scopes ​ Pre-requisites Salesforce Financial Services Cloud account. You can create one here . ​ Required Settings Mandatory Scopes api refresh token App Settings Require Secret for Refresh Token Flow Enable Authorization Code and Credentials Flow Enable Token Exchange Flow Require Secret for Token Exchange Flow Issue JSON Web Token (JWT)-based access tokens for named users If you haven’t already created an app in Salesforce Financial Services Cloud, you’d need to create one. ​ Creating an app in Salesforce Financial Services Cloud To create a Salesforce Financial Services Cloud app and aquire the app credentials, please follow the steps mentioned below: Log in to your Salesforce Financial Services Cloud dashboard with your developer account credentials. Click on the Gear icon in the top right and select Setup button. Select Apps > App Manager options from the left side menu under Platform Tools section. Select New Connected App button in the setup page. Enter the basic details of your application Under API (Enable OAuth Settings) , mark the Enable OAuth Settings checkbox. Go to your Apps catalog > Search for Salesforce Finance > Settings > Use your credentials > Callback Url > Copy it. Paste this under the Callback URL field of the app. Select the required scopes, including the mandatory scopes mentioned above . Enable the required App Settings mentioned above, click on the Save button and click Continue . Click on the Manage Consumer Details button under the API (Enable OAuth Settings) section, verify your identity and copy the Consumer Key and Consumer Secret . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Salesforce Financial Services Cloud actions and triggers. Following are the set of Salesforce Financial Services Cloud actions and triggers supported by Cobalt. Actions Triggers Account Create Account - Create an account in Salesforce Financial Services Cloud. Goal Create Goal - Create a goal in Salesforce Financial Services Cloud. Update Goal - Update a goal in Salesforce Financial Services Cloud. Search Goal - Search a goal in Salesforce Financial Services Cloud. Record Alert Create Record Alert Person - Create record alert for Person account in Salesforce Financial Services Cloud. Create Record Alert Financial - Create record alert for Financial account in Salesforce Financial Services Cloud. Others HTTP Request - Make HTTP API calls to any Salesforce Financial Services Cloud documented REST APIs. Building a Salesforce integration Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Salesforce Financial Services Cloud Configuring credentials in Cobalt Actions and triggers"
}