{
    "url": "https://docs.gocobalt.io/resources/integration-providers/pardot_create",
    "text": "Pardot Business Unit Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Pardot Pardot Business Unit Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Overview Pardot Business Unit Setup Setup Building a Pardot integration Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Pardot Pardot Business Unit Setup In this you will get to know the step by step process to configure your Salesforce Pardot Org. ​ Steps Follow the steps given below to create your Pardot account. ​ 1. Sign Up for Pardot Org Sign up on below link https://developer.salesforce.com/promotions/orgs/pardot-de . Once you fill the signup form, you will receive an email and you can set your password. ​ 2. Install Package Install the package by going to the following link : http://www2.pardot.com/notes/pardot-appexchange-package-download-and-release-notes/ . Click on Production Environments > Login with your Pardot credentials > Select Install for All Users > Click on Install . ​ 3. Setup Pardot Business Unit Go to Setup > Search for Account Engagement > Business Unit Setup > Give the Business Unit name and assign an Admin > Click on Save . ​ 4. Enable Pardot Lightning App in Marketing Setup Click on the Gear icon in the top nav bar and select Marketing Setup . In Marketing Setup, go to Setup Assistant > Beyond the Basics > Toggle on the Turn on Account Engagement Lightning App permission. ​ 5. Assign Permission set We can assign Permission Sets to our user like CRM, Sales etc. For now, we are assigning Sales Cloud User Permission set. Go to Setup > User > Permission Set > Select Sales Cloud User . Click on Manage Assignments > Click on Add Assignment > Select a User > Click on Next > Assign the user with a role. ​ 6. Pardot managed connected App settings Now go back to Setup by clicking on the Gear icon in the top nav bar. Search for Manage Connected Apps > Click on Edit in b2bma_canvas and make sure it’s configured as shown below. ​ 7. Access your Pardot App The Pardot App Setup is now complete and you can access it by login with Salesforce to the link below: https://pi.demo.pardot.com/ You can learn about how to setup the OAuth app for Pardot here . Congratulations!! You have now successfully setup a Pardot Business Unit in your Salesforce account. Overview Setup linkedin twitter Powered by Mintlify On this page Steps 1. Sign Up for Pardot Org 2. Install Package 3. Setup Pardot Business Unit 4. Enable Pardot Lightning App in Marketing Setup 5. Assign Permission set 6. Pardot managed connected App settings 7. Access your Pardot App"
}