{
    "url": "https://docs.gocobalt.io/resources/integration-providers/copper",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Copper Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Connect Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Copper Connect Connect with the Linked Account’s Copper CRM account. Copper is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Copper integration, a Linked Account or an end-user will need to provide the following to connect: API Key Email Address To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Copper To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Copper account . Click on the Settings button in the side menu > Choose Integrations and select API Keys . Click on Generate API Key and copy the API Key and the Email present in the Creator field of the API. The Linked Account or end-user now have all the credentials required to connect with Copper. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Copper actions and triggers. Following are the set of Copper actions and triggers supported by Cobalt. Actions Triggers Company Create Company - Create a new company in Copper. Update Company - Update a company in Copper. Delete Company - Delete a company in Copper. Lead Create Lead - Create a new lead in Copper. Update Lead - Update a lead in Copper. Delete Lead - Delete a Lead in Copper. Opportunity Create Opportunity - Create a new opportunity in Copper. Update Opportunity - Update an opportunity in Copper. Delete Opportunity - Delete an opportunity in Copper. Person Create Person - Create a new person in Copper. Update Person - Update a person in Copper. Delete Person - Delete a person in Copper. Others HTTP Request - Make HTTP API calls to any Copper documented REST APIs. Setup Connect linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Copper Actions and triggers"
}