{
    "url": "https://docs.gocobalt.io/resources/integration-providers/monday",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Monday Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday Setup MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Monday Setup Connect to your Monday App for OAuth. Cobalt offers both Key Based and OAuth 2.0 integration for Monday. In this guide, we will look at the OAuth App setup process. To setup your Monday app in Cobalt for OAuth, you will need the following credentials from your Monday Developer account: Client ID Client Secret Scopes ​ Pre-requisites Monday Developer account. You can create one here . ​ Required Settings Mandatory Scopes me:read webhooks:write If you haven’t already created an app in Monday, you’d need to create one. ​ Creating an app in Monday To create a Monday app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Monday Developer account . Click on the Profile icon in the top right and select Developers button. Click on Create app button under My Apps . Enter the Name for your application under Basic Information and click Save App . Go to your Apps catalog in Cobalt > Search for Monday > Settings > Use your credentials > Callback Url > Copy it. Go to OAuth in the app in the side menu > Go to the Redirect URLs tab > Paste the Callback Url > Click on Save Scopes . Select the mandatory scopes in the Scopes tab under OAuth , as provided in your Cobalt Monday settings page and click on the Save Scopes button. Go to the Basic Information section and copy the Client ID and Client Secret from the App Credentials section. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Monday Developer account and update the scopes as added on Cobalt. Select the OAuth App created for Cobalt > Click on Scopes tab under OAuth > Add the scopes as added in Cobalt > Click on Save Scopes . If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Monday actions and triggers. Following are the set of Monday actions and triggers supported by Cobalt. Actions Triggers Board Create Board - Create a board in Monday. Update Board - Update a board in Monday. Delete Board - Delete a board in Monday. Group Create Group - Create a group in Monday. Update Group - Update a group in Monday. Delete Group - Delete a group in Monday. Item Create Item - Create an item in Monday. Update Item - Update an item in Monday. Delete Item - Delete an item in Monday. Sub-item Create Subitem - Create a subitem in Monday. Update Subitem - Update a subitem in Monday. Delete Subitem - Delete Subitem in Monday. Others HTTP Request - Make HTTP API calls to any Monday documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Monday Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}