{
    "url": "https://docs.gocobalt.io/resources/integration-providers/jibble",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Jibble Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Connect Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Jibble Connect Connect with the Linked Account’s Jibble account. Jibble is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Jibble integration, a Linked Account or an end-user will need to provide the following to connect: API Key ID API Key Secret To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Jibble To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Jibble account . Click on Organization under Settings in the side menu and click on API Credentials tab. Click on Create New Secret button, enter the Name and click on Save . Copy the API Key ID and API Key Secret displayed. Copy the API Key Secret as it will not be shown again. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Jibble actions and triggers. Following are the set of Jibble actions and triggers supported by Cobalt. Actions Triggers Clients List Clients - List clients in Jibble. Members List Members - List members in Jibble. Create Member - Create member in Jibble. Update Member - Update member in Jibble. Delete Member - Delete a member in Jibble. Time Offs List Time Offs - List time off overview in Jibble. Create Time Off Request - Create a time off interval in Jibble. Update Time Off Request - Update a time off interval in Jibble. Others HTTP Request - Make HTTP API calls to any Jibble documented REST APIs. Setup Overview linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Jibble Actions and triggers"
}