{
    "url": "https://docs.gocobalt.io/resources/integration-providers/customer_io",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Customer.io Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Connect Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Customer.io Connect Connect with the Linked Account’s Customer.io account. Customer.io is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Customer.io integration, a Linked Account or an end-user will need to provide the following to connect: API Key Site ID To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Customer.io To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Customer.io account . Click on the Gear icon in the top nav bar and click on Account Settings option. Select API Credentials option > Click on Create Track API Key > Provide a Name and select a Workspace > Click on Create Track API Key button. Copy the Site ID and API Key displayed. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Customer.io actions and triggers. Following are the set of Customer.io actions and triggers supported by Cobalt. Actions Triggers Customer Create Or Update Customer - Create or update customer in Customer.io. Customer Event Track Customer Event - Track a customer event in Customer.io. Others HTTP Request - Make HTTP API calls to any Customer.io documented REST APIs. Connect Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Customer.io Actions and triggers"
}