{
    "url": "https://docs.gocobalt.io/resources/integration-providers/amazons3",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Amazon S3 Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Connect Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Amazon S3 Connect Connect with the Linked Account’s Amazon S3 account. Amazon S3 is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the AWS Security Hub integration, a Linked Account or an end-user will need to provide the following to connect: Access Key ID Secret access key Region To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Amazon S3 To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your AWS Account with S3 Permissions and copy the Region from the URL present before .console . Click on your Profile in the top right corner and click on Security Credentials . Scroll down to the Access Keys section and click on Create access key . Select a Use case > Click on Next and provide a name for the key under Description tag value and click on Create access key . Copy the Access Key and Secret access key displayed on the screen. Save your Secret Key as it will be visible only once. The Linked Account or end-user now have all the credentials required to connect with Amazon S3. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Amazon S3 actions and triggers. Following are the set of Amazon S3 actions and triggers supported by Cobalt. Actions Triggers Bucket Get Buckets - Returns a list of all buckets owned by the authenticated sender in Amazon S3. Delete Bucket - Delete a bucket in Amazon S3. Object Get Objects - Get Objects from Bucket in Amazon S3. Get Object By Key - Get Object By Key from Bucket in Amazon S3. Create Object - Creates an Object in Bucket in Amazon S3. Delete Object - Deletes an Object from Buckett in Amazon S3. Others HTTP Request - Make HTTP API calls to any Amazon S3 documented REST APIs. Setup Connect linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Amazon S3 Actions and triggers"
}