{
    "url": "https://docs.gocobalt.io/resources/integration-providers/pandle",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Pandle Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Setup Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Pandle Setup Connect to your Pandle app for OAuth. To setup your Pandle app in Cobalt for OAuth, you will need the following credentials from your Pandle account : Client ID Client Secret If you haven’t already created an app in Pandle, you’d need to create one. ​ Creating an app in Pandle Currently Pandle doesn’t support online registrations, so you’ll need to send an email to support@pandle.com that includes the following details: App name : A short name for your app. Your customers will see this when they authorize your connection to their data. Description : A short description of what your app does. Re-direct URI : Go to your Apps catalog in Cobalt > Search for Pandle > Settings > Use your credentials > Callback Url > Copy it. Provide this URL to Pandle support in the mail. Pandle will issue secure keys to you, including a Client ID and Client Secret . It may take a number of working days to receive these details. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client ID and Client Secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Pandle actions and triggers. Following are the set of Pandle actions and triggers supported by Cobalt. Actions Triggers Account List Bank Accounts - Get a list of bank accounts for a company in Pandle. Create Bank Account - Create a new bank account for a company in Pandle. Update Bank Account - Update a bank account for a company in Pandle. Delete Bank Account - Delete a bank account for a company in Pandle. Invoice List Invoices - Get a list of invoices in Pandle. Create Invoice - Create an invoice in Pandle. Update Invoice - Update an invoice in Pandle. Get Invoice by ID - Get an invoice in Pandle. Project List Projects - Get a list of projects in Pandle. Create Project - Create a project in Pandle. Update Project - Update a project in Pandle. Get Project by ID - Get a project in Pandle. Others HTTP Request - Make HTTP API calls to any Pandle documented REST APIs. List Bank Transactions - Get a list of bank transactions for a bank account in Pandle. Setup Overview linkedin twitter Powered by Mintlify On this page Creating an app in Pandle Configuring credentials in Cobalt Actions and triggers"
}