{
    "url": "https://docs.gocobalt.io/resources/integration-providers/asana",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Asana Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Setup Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Asana Setup Connect to your Asana app for OAuth. To setup your Asana app in Cobalt for OAuth, you will need the following credentials from your Asana Developer Console : Client ID Client Secret Scopes ​ Pre-requisites Asana Developer Console. You can create one here . If you haven’t already created an app in Asana, you’d need to create one. ​ Creating an app in Asana To create a Asana app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Asana Developer Console . Under My apps , click on the Create new app button. Enter the App name for your application, select description for app and click on Create app . Go to your Apps catalog in Cobalt > Search for Asana > Settings > Use your credentials > Callback Url > Copy it. In the OAuth app, navigate to OAuth under Configure in the side menu > Click on + Add redirect URL > Paste the Callback Url > Click on Add . Click on Manage distribution in the side menu and choose a distribution method based on your requirements. Learn more about app distribution here . Navigate to Basic information and copy the Client ID and Client Secret . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth2 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Asana actions and triggers. Following are the set of Asana actions and triggers supported by Cobalt. Actions Triggers Task Create Task - Create a task in Asana. Update Task - Update a task in Asana. Delete Task - Delete a task in Asana. Project Create Project - Create a project in Asana. Section Create Section - Create a section in a project in Asana. Others HTTP Request - Make HTTP API calls to any Asana documented REST APIs. Connect Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Asana Configuring credentials in Cobalt Actions and triggers"
}