{
    "url": "https://docs.gocobalt.io/resources/integration-providers/agilecrm",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Agile CRM Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Connect Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Agile CRM Connect Connect with the Linked Account’s Agile CRM account. Agile CRM is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Agile CRM integration, a Linked Account or an end-user will need to provide the following to connect: API Key Email Domain To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Agile CRM To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Agile CRM account and copy your Domain from the URL. Your Login Email is the Email required. Click on your Profile icon in the top right corner and click on Admin Settings . Navigate to Developers & API in the side menu > Copy the REST API given. This is the API key. The Linked Account or end-user now have all the credentials required to connect with Agile CRM. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Agile CRM actions and triggers. Following are the set of Agile CRM actions and triggers supported by Cobalt. Actions Triggers Company Create Company - Create a company in Agile CRM. Update Company - Update a company in Agile CRM. Contacts List Contacts - List all contacts in Agile CRM. Create Contact - Create a new contact in Agile CRM. Update Contact - Update a contact in Agile CRM. Delete Contact - Delete a contact in Agile CRM. Deals List Deals - List all deals in Agile CRM. Create Deal - Create a deal in Agile CRM. Update Deal - Update a deal in Agile CRM. Notes Create Note For Contact - Create note for a contact in Agile CRM. Create Note For Deal - Create note for a deal in Agile CRM. Update Note For Deal - Update note for deal in Agile CRM. Tasks List Tasks - List all tasks in Agile CRM. Create Task - Create new task in Agile CRM. Update Task - Update a task in Agile CRM. Delete Task - Delete a task in Agile CRM. Others HTTP Request - Make HTTP API calls to any Agile CRM documented REST APIs. Setup Connect linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Agile CRM Actions and triggers"
}