{
    "url": "https://docs.gocobalt.io/resources/integration-providers/apptivo",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Apptivo Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Connect Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Apptivo Connect Connect with the Linked Account’s Apptivo account. Apptivo is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Apptivo integration, a Linked Account or an end-user will need to provide the following to connect: API Key Access Key To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Apptivo CRM To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Apptivo CRM account . Click on the Profile icon in the top right and click on Business Settings . Click on API Access in the side menu and copy the API Key and Access Key displayed. The Linked Account or end-user now have all the credentials required to connect with Apptivo CRM. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Apptivo actions and triggers. Following are the set of Apptivo actions and triggers supported by Cobalt. Actions Triggers Case Create Case - Create a new case in Apptivo. Update Case - Update a case in Apptivo. Delete Case - Delete a case in Apptivo. Contact Create Contact - Create a new Contact in Apptivo. Update Contact - Update a Contact in Apptivo. Delete Contact - Delete a Contact in Apptivo. Customer Create Customer - Create a new customer in Apptivo. Update Customer - Update a customer in Apptivo. Delete Customer - Delete a customer in Apptivo. Lead Create Lead - Create a new lead in Apptivo. Update Lead - Update a lead in Apptivo. Delete Lead - Delete a lead in Apptivo. Opportunity Create Opportunity - Create a new opportunity in Apptivo. Update Opportunity - Update a opportunity in Apptivo. Delete Opportunity - Delete a opportunity in Apptivo. Others HTTP Request - Make HTTP API calls to any Apptivo documented REST APIs. Connect Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Apptivo CRM Actions and triggers"
}