{
    "url": "https://docs.gocobalt.io/resources/integration-providers/miro",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Miro Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Setup Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Miro Setup Connect to your Miro app for OAuth. To setup your Miro app in Cobalt for OAuth, you will need the following credentials from your Miro Developer Hub : Client ID Client Secret Scopes ​ Pre-requisites Miro Developer account. You can create one here . If you haven’t already created an app in Miro, you’d need to create one. ​ Creating an app in Miro To create a Miro app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Miro Developer Hub . Click on Your apps in the left menu. Click on + Create a new app button in the top right, enter the App Name , select the Developer Team, Enable Expire user authorization token and click on the Create app button. Go to your Apps catalog in Cobalt > Search for Miro > Settings > Use your credentials > Callback Url > Copy it. In the OAuth app created for Cobalt, scroll down to Redirect URI for OAuth2.0 section, paste the Callback Url and click on Add . Scroll to the App Credentials section and copy the Client ID and Client Secret . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth2 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Miro Developer Hub and update the scopes as added on Cobalt. Navigate to Developer Hub > Select the OAuth App created for Cobalt > Scroll down to Permissions section > Add the scopes as added in Cobalt. If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Miro actions and triggers. An action with any API of Miro can be created by using the HTTP Request Action. Building a Marketo integration Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Miro Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}