{
    "url": "https://docs.gocobalt.io/resources/integration-providers/basecamp",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Basecamp Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp Setup BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Basecamp Setup Connect to your Basecamp app for OAuth. To setup your Basecamp app in Cobalt for OAuth, you will need the following credentials from your Basecamp Integrations Page : Client ID Client Secret ​ Pre-requisites Basecamp account. You can create one here . If you haven’t already created an app in Basecamp, you’d need to create one. ​ Creating an app in Basecamp To create a Basecamp app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Basecamp Integrations Page . Click on Register another application button in the centre. Enter the Name of your application , Company Name and Website URL and select Product as Basecamp 4 . Go to your Apps catalog in Cobalt > Search for Basecamp > Settings > Use your credentials > Callback Url > Copy it. Paste the Callback URL under Redirect URI in Basecamp and click on the Register this app button. Scroll down in the OAuth2 section and copy the Client ID and Client Secret . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Basecamp actions and triggers. Following are the set of Basecamp actions and triggers supported by Cobalt. Actions Triggers Project Create Project - Create a project in Basecamp. Delete Project - Delete a project in Basecamp. ToDo List Create ToDo List - Create a ToDo List in Basecamp. ToDo Create ToDo - Create a ToDo in Basecamp. Others HTTP Request - Make HTTP API calls to any Basecamp documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Basecamp Configuring credentials in Cobalt Actions and triggers"
}