{
    "url": "https://docs.gocobalt.io/resources/integration-providers/adobe_workfront",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Adobe Workfront Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Setup Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Adobe Workfront Setup Connect to your Adobe Workfront app for OAuth. Cobalt offers both Key Based and OAuth 2.0 integration for Adobe Workfront. In this guide, we will look at the OAuth App setup process. To setup your Adobe Workfront app in Cobalt for OAuth, you will need the following credentials from your Adobe Workfront account : Client ID Client Secret ​ Pre-requisites Adobe Workfront account. You can create a test account here . If you haven’t already created an app in Adobe Workfront, you’d need to create one. ​ Creating an app in Adobe Workfront To create a Adobe Workfront app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Adobe Workfront account . Click on the waffle icon in the top right of the nav bar, select Setup in the menu and choose OAuth2 Application under System in the side menu. Click on Create app integration button > Choose Web Application under Authentication method > Provide a Name for your app and click on Create . Go to your Apps catalog in Cobalt > Search for Adobe Workfront > Settings > Use your credentials > Callback Url > Copy it. Select the app created, paste the Callback Url under Redirect URls and click on Save . Copy the Client ID' and generate a Secret by clicking on +Add Client Secret` under Basic information section. Store the Client Secret somewhere as it will be shown only once. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client Secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Adobe Workfront actions and triggers. Following are the set of Adobe Workfront actions and triggers supported by Cobalt. Actions Triggers Document Update Document - Updates existing Document By ID in Adobe Workfront. Delete Document - Delete existing Document By ID in Adobe Workfront. Get Documents - Search all Documents in Adobe Workfront. Folder Create Folder - Creates a new Folder in Adobe Workfront. Update Folder - Updates existing Folder By ID in Adobe Workfront. Delete Folder - Delete existing Folder By ID in Adobe Workfront. Get Folders - Search all Folders in Adobe Workfront. Project Create Project - Creates a new Project in Adobe Workfront. Update Project - Updates existing Project By ID in Adobe Workfront. Get Projects - Search all Projects in Adobe Workfront. Delete Folder - Delete existing Folder By ID in Adobe Workfront. Get Folders - Search all Folders in Adobe Workfront. Task Create Task - Creates a new Task in Adobe Workfront. Update Task - Updates existing Task By ID in Adobe Workfront. Delete Task - Delete existing Task By ID in Adobe Workfront. Get Task - Search all Tasks in Adobe Workfront. User Create User - Creates a new user in Adobe Workfront. Update User - Updates existing user By ID in Adobe Workfront. Delete User - Delete existing user By ID in Adobe Workfront. Get Users - Search all Users in Adobe Workfront. Others HTTP Request - Make HTTP API calls to any Adobe Workfront documented REST APIs. Setup Connect linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Adobe Workfront Configuring credentials in Cobalt Actions and triggers"
}