{
    "url": "https://docs.gocobalt.io/resources/integration-providers/harvest",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Harvest Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Setup Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Harvest Setup Connect to your Harvest app for OAuth. Cobalt offers both Key Based and OAuth 2.0 integration for Harvest. In this guide, we will look at the OAuth App setup process. To setup your Harvest app in Cobalt for OAuth, you will need the following credentials from your Harvest Developer account : Client ID Client Secret ​ Pre-requisites Harvest Developer account. You can create one here . If you haven’t already created an app in Harvest, you’d need to create one. ​ Creating an app in Harvest To create a Harvest app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Harvest Developer account . Click on the Developers icon in the top nav bar and click on Create new OAuth2 application button under OAuth2 Applications section. Go to your Apps catalog in Cobalt > Search for Harvest > Settings > Use your credentials > Callback Url > Copy it. Provide an app Name > Paste the Callback Url under Redirect URL > Choose Access as I can work with multiple accounts > Click on Create Application . Copy the Client ID and Client Secret from the Parameters section. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Harvest actions and triggers. Following are the set of Harvest actions and triggers supported by Cobalt. Actions Triggers Invoice List Invoices - List all invoices in Harvest. Create Invoice - Create an invoice in Harvest. Update Invoice - Update an invoice in Harvest. Delete Invoice - Delete an invoice in Harvest. Time Entry List Time entries - List all time entries in Harvest. Create Time Entry by duration - Create a time entry by duration in Harvest. Update Time Entry - Update a time entry in Harvest. Users List Users - List all users in Harvest. Create User - Create a new user in Harvest. Delete User - Delete a user in Harvest. Payments List Payments - List all payments in Harvest. Create Invoice Payment - Create an invoice payment in Harvest. Company Update Company - Update a company in Harvest. Get a Company - Get a company by ID in Harvest. Others HTTP Request - Make HTTP API calls to any Harvest documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Harvest Configuring credentials in Cobalt Actions and triggers"
}