{
    "url": "https://docs.gocobalt.io/resources/integration-providers/teamwork",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Teamwork Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Setup Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Teamwork Setup Connect to your Teamwork app for OAuth. Cobalt offers both Key Based and OAuth 2.0 integration for Teamwork. In this guide, we will look at the OAuth App setup process. To setup your Teamwork app in Cobalt for OAuth, you will need the following credentials from your Teamwork Developer account : Client ID Client Secret Scopes ​ Pre-requisites Teamwork Developer account. You can create one here . If you haven’t already created an app in Teamwork, you’d need to create one. ​ Creating an app in Teamwork To create a Teamwork app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Teamwork Developer account. Click on Create an app button in the top right corner. Go to your Apps catalog in Cobalt > Search for Teamwork > Settings > Use your credentials > Callback Url > Copy it. Enter the Name for your application > Choose Product as Teamwork > Paste the Callback Url under Redirect URIs and click on Create App button. Click on the app created, go to the Credentials tab and copy the Client ID and Client Secret . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Publishing Teamwork App When the app is created in the Teamwork Developer Portal, it’s status is shown as In development . This means your app is currently in development mode and it can only be used by the Teamwork account it was created under. Once you are ready to publish your app and make it available to all Teamwork users, please contact integrations@teamwork.com . Learn more about the pre-requisites to complete for the app publishing process here . ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Teamwork actions and triggers. An action with any API of Teamwork can be created by using the HTTP Request Action. Setup Connect linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Teamwork Configuring credentials in Cobalt Publishing Teamwork App Actions and triggers"
}