{
    "url": "https://docs.gocobalt.io/resources/integration-providers/wrike",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Wrike Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Setup Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Wrike Setup Connect to your Wrike app for OAuth. To setup your Wrike app in Cobalt for OAuth, you will need the following credentials from your Wrike Developer account : Client ID Client Secret Scopes ​ Pre-requisites Wrike Developer account. You can create one here . ​ Required Settings Mandatory Scopes Default If you haven’t already created an app in Wrike, you’d need to create one. ​ Creating an app in Wrike To create a Wrike app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Wrike Developer account . In the API Apps section, provide an App name and click on Create new button. Go to your Apps catalog in Cobalt > Search for Wrike > Settings > Use your credentials > Callback Url > Copy it. Paste the copied Callback Url in the Redirect URI field of the app and click on Save . From the OAuth section, copy the Client ID and Client Secret displayed. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Wrike actions and triggers. Following are the set of Wrike actions and triggers supported by Cobalt. Actions Triggers Accounts List Accounts - List all accounts in Wrike. Update Account - Update an account in Wrike. Folders Create Folder - Create a new folder in Wrike. List Folders - List all folders in Wrike. Update Folders - Modify a folder in Wrike. Space Create Space - Create a new space in Wrike. List Space - List all space in Wrike. Tasks List Tasks - List all tasks in Wrike. Update Task - Update a task in Wrike. Create Task - Create a new Task in Wrike. Others HTTP Request - Make HTTP API calls to any Wrike documented REST APIs. Connect Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Wrike Configuring credentials in Cobalt Actions and triggers"
}