{
    "url": "https://docs.gocobalt.io/resources/integration-providers/salesloft",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Salesloft Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Setup Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Salesloft Setup Connect to your Salesloft app for OAuth. Cobalt offers both Key Based and OAuth 2.0 integration for Salesloft. In this guide, we will look at the OAuth App setup process. To setup your Salesloft app in Cobalt for OAuth, you will need the following credentials from your Salesloft Developer account : Client ID Client Secret Scopes ​ Pre-requisites Salesloft Developer account. ​ Required Settings Mandatory Scopes Accounts: Manage Accounts: Read If you haven’t already created an app in Salesloft, you’d need to create one. ​ Creating an app in Salesloft To create a Salesloft app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Salesloft Developer account . Click on the Manage Apps button in the top nav bar. Click on Create New button in OAuth Applications . Go to your Apps catalog in Cobalt > Search for Salesloft > Settings > Use your credentials > Callback Url > Copy it. Give the app Name > Paste the Callback Url copied under Redirect URL field > Select Application Type as Public application > Select the required Scopes and click on Save . Appl type is selected as Public Application to ensure people outside your organization can authenticate with it as well. Copy the Application ID (Client ID) and Secret (Client Secret) displayed on the screen. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Salesloft Developer account and update the scopes as added on Cobalt. Select the OAuth App created for Cobalt and click on Edit for it > Add the scopes under Scopes as added in Cobalt > Click on Submit . If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ Getting Production Credentials of App Once you’ve built your app using OAuth Authenication, you must submit it to be reviewed for allowlisting so that it can be used by other Salesloft instances. To more about the Salesloft App Publishing process, refer here . ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Salesloft actions and triggers. Following are the set of Salesloft actions and triggers supported by Cobalt. Actions Triggers Accounts Create Account - Create a new account in Salesloft. List Accounts - Get a list of accounts in Salesloft. Update Account - Update an account in Salesloft. Delete Account - Delete an account in Salesloft. Calls Create Calls - Create a new call in Salesloft. List Calls - List all calls in Salesloft. Notes Create Note - Create a note in Salesloft. Update Note - Update a note in Salesloft. Get Note by ID - Get a note by ID in Salesloft. Tasks Create Tasks - Create a new task in Salesloft. List Tasks - List all tasks in Salesloft. Get Task by ID - Get a task by ID in Salesloft. Custom Fields Create Custom Fields - Create new custom fields in Salesloft. User Get Profile - Get profile in Salesloft. Others HTTP Request - Make HTTP API calls to any Salesloft documented REST APIs. Setup Connect linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Salesloft Configuring credentials in Cobalt Configuring Scopes Getting Production Credentials of App Actions and triggers"
}