{
    "url": "https://docs.gocobalt.io/resources/integration-providers/marketo",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Marketo Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Overview Connect Building a Marketo integration Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Marketo Connect Connect with the Linked Account’s Marketo account. Marketo is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Marketo integration, a Linked Account or an end-user will need to provide the following to connect: Client ID Client Secret REST Endpoint Identity Endpoint To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Marketo To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Marketo account. Click on the Admin option in the top nav bar and select LaunchPoint under Integration in the side menu . Click on New > New Service option. Enter the Display Name for your application, select Service as Custom , give it a description, select the user in API Only User and click on Create . Select the Custom_app created and click on View Details . Copy the Client ID and Client Secret of the user. Click on Web Services under Integration in the side menu > Scroll down to REST API section and copy the REST Endpoint and Identity . The Linked Account or end-user now have all the credentials required to connect with Marketo. Overview Building a Marketo integration linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Marketo"
}