{
    "url": "https://docs.gocobalt.io/resources/integration-providers/keka",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Keka HR Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Connect Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Keka HR Connect Connect with the Linked Account’s Keka account. Keka is a Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Keka HR integration, a Linked Account or an end-user will need to provide the following to connect: Client ID Client Secret API Token API Domain To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Keka To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Keka account and copy the Domain of your Keka account. This is the API Domain . Click on the Gear icon in the top nav bar and select Integration and Automation button. Go to API Access tab and click on Create New Key button. Enter the Name > Copy the API Key (API Token) > Select the scopes required and click on Save . Copy the Client ID and Client Secret from the API Key section. ​ Keka Single Webhook URL If you wish to create an orchestration where a workflow is being triggered when some operation occurs in Keka HR, you’d need to subscribe to Keka’s Webhook. Cobalt provides a single webhook URL to manage such event triggers for all your customers. To setup Keka webhook subscription: Select Keka from the application list in Cobalt , and select Settings . Copy the Single Webhook Url Go to Communications in your Keka Account Settings. Select the Event Category which you want to subscribe to > Select the Event > Click on Add Action > Webhook > Give the Webhook a Name > Paste the Single Webhook Url inside the “Webhook Endpoint” field. Click on Test and click on Create . ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Keka actions and triggers. Following are the set of Keka actions and triggers supported by Cobalt. Actions Triggers Candidates Get Candidates - Get all candidates in Keka. Create Candidate - Create a new candidate in Keka. Update Candidate - Update a candidate in Keka. Employees Get All Employees - Get all employees in Keka. Create Employee - Create an employee in Keka. Get Employee - Get an employee in Keka. Update Employee - Update an employee in Keka. Jobs Get Jobs - Get all jobs in Keka. Projects Get Projects - Get all projects in Keka. Create Project - Create a new project in Keka. Time Entries Get Time Entries - Get all time entries in Keka. Others HTTP Request - Make HTTP API calls to any Keka documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Keka Keka Single Webhook URL Actions and triggers"
}