{
    "url": "https://docs.gocobalt.io/resources/integration-providers/contentful",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Contentful Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Setup Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Contentful Setup Connect to your Contentful app for OAuth. To setup your Contentful app in Cobalt for OAuth, you will need the following credentials from your Contentful Developer account : Client ID Client Secret Scopes ​ Pre-requisites Contentful Developer account. You can create one here . ​ Required Settings Mandatory Scopes content_management_manage If you haven’t already created an app in Contentful, you’d need to create one. ​ Creating an app in Contentful To create a Contentful app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Contentful Developer account . Click on your Profile in the top right corner, select Account Settings and switch to OAuth applications tab. Click on New Application button and provide a Name and Description of the app. Go to your Apps catalog in Cobalt > Search for Contenful > Settings > Use your credentials > Callback Url > Copy it. Paste the copied Callback Url in the Redirect URI field of the app creation form. Select Content management manage and Confidential checkbox and click on the Create Application button. Copy the Client ID and Client Secret displayed. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Contentful actions and triggers. Following are the set of Contentful actions and triggers supported by Cobalt. Actions Triggers Assets Get Assets - Get all assets in Contentful. Create Asset - Create a new asset in Contentful. Update Asset - Update an asset in Contentful. Environment Template Create Environment Template - Create new Environment Template in Contentful. Update Environment Template - Update Environment Template in Contentful. Files Upload File - Upload a Binary File in Contentful. Spaces Get Spaces - List all space in Contentful. Create Space - Create a new space in Contentful. Others HTTP Request - Make HTTP API calls to any Contentful documented REST APIs. Setup Connect linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Contentful Configuring credentials in Cobalt Actions and triggers"
}