{
    "url": "https://docs.gocobalt.io/resources/integration-providers/freshsales",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation FreshSales CRM Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Connect Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom FreshSales CRM Connect Connect with the Linked Account’s Freshsales account. Freshsales is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Freshsales integration, a Linked Account or an end-user will need to provide the following to connect: API Key Freshsales CRM Domain To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Freshsales To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Freshsales account . Go to the Settings option in the side menu and click on Apps & Integrations option. Click on API Settings and copy the API Key displayed as Your API Key and the Freshsales CRM Domain displayed as Your bundle alias . The Linked Account or end-user now have all the credentials required to connect with Freshsales. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Freshsales actions and triggers. Following are the set of Freshsales actions and triggers supported by Cobalt. Actions Triggers Account Create Account - Create an account in Freshsales. Update account - Update an account in Freshsales. Delete account - Delete an account in Freshsales. Contact Create Contact - Add a new contact in Freshsales. Update Contact - Update a contact in Freshsales. Delete Contact - Delete a contact in Freshsales. Deal Create Deal - Create a deal in Freshsales. Update Deal - Update a deal in Freshsales. Delete Deal - Delete a deal in Freshsales. Others HTTP Request - Make HTTP API calls to any Freshsales documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Freshsales Actions and triggers"
}