{
    "url": "https://docs.gocobalt.io/resources/integration-providers/docusign",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation DocuSign Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Setup Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom DocuSign Setup Connect to your DocuSign app for OAuth. To setup your DocuSign app in Cobalt for OAuth, you will need the following credentials from your DocuSign Developer account : Client ID Client Secret Scopes ​ Pre-requisites DocuSign Developer account. You can create one here . ​ Required Settings Mandatory Scopes Openid Extended Signature If you haven’t already created an app in DocuSign, you’d need to create one. ​ Creating an app in DocuSign To create a DocuSign app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your DocuSign Developer account . Click on the Profile icon in the top right corner and select My Apps & Keys button. Click on Add App and Integration Key button. Enter the unique App Name for your application and click on the Create App button. Go to your Apps catalog in Cobalt > Search for DocuSign > Settings > Use your credentials > Callback Url . Scroll down in the App to Additional settings section > click on + Add URL > paste the Callback URL copied from Cobalt . Scroll to the Authentication section > Mark Yes under User Application > Click on + Add Secret Key button > Copy it > Click on Save button at the bottom of the page. This is the Client Secret . Copy the string under Integration Key above Authentication section. This is the Client ID . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth2 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client Secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, the app will now request for access of the mentioned scopes. If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using DocuSign actions and triggers. Following are the set of DocuSign actions and triggers supported by Cobalt. Actions Triggers HTTP Request - Make HTTP API calls to any Docusign documented REST APIs. Create and send envelope from template - Create and send and envelope from a DocuSign template. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in DocuSign Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}