{
    "url": "https://docs.gocobalt.io/resources/integration-providers/quickbooks",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation QuickBooks Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Setup Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom QuickBooks Setup Connect to your QuickBooks app for OAuth. To setup your QuickBooks app in Cobalt for OAuth, you will need the following credentials from your Intuit Developer Account : Client ID Client Secret Scopes ​ Pre-requisites Intuit Developer Account. You can create one here . ​ Required Settings Mandatory Scopes com.intuit.quickbooks.accounting openid If you haven’t already created an app in QuickBooks, you’d need to create one. ​ Creating an app in QuickBooks To create a QuickBooks app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your QuickBooks Developer Portal . Click on the Dashboard icon in the top navigation bar. Click on + Create an App button in the right and choose QuickBooks Online and Payments . Enter the unique App Name for your application, select the mandatory scope and click on Create app button. Go to your Apps catalog in Cobalt > Search for QuickBooks > Settings > Use your credentials > Callback Url > Copy it. In the OAuth app created for QuickBooks , depending on whether the application is in Development or Production , navigate to Keys & credentials in the left menu and got to Redirect URIs section. Remove the default URI given > Paste the Callback Url copied from Cobalt > Click on the Save button. Go to Keys section in Keys & credentials and copy the Client ID and Client Secret from here. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth2 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, go to your Intuit Developer Account and update the scopes as added on Cobalt. Scopes cannot be removed once they are assigned to an App. Select the OAuth App created for Cobalt > Click on Production Settings in the left menu > Scroll down to Scope for the API section > Select the Scope > Click on the Save button. If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. And, the scopes selected here are identical to the ones selected in the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using QuickBooks actions and triggers. Following are the set of QuickBooks actions and triggers supported by Cobalt. Actions Triggers Bill Create Bill - Create a new bill in QuickBooks. Update Bill - Update a bill in QuickBooks. Delete Bill - Delete a bill in QuickBooks. Invoice Create Invoice - Create an invoice in QuickBooks. Update Invoice - Update an invoic in QuickBooks. Delete Invoice - Delete an invoic in QuickBooks. Customer Create Customer - Create a customer in QuickBooks. Update Customer - Update a customer in QuickBooks. Item Create Item - Create an item in QuickBooks. Update Item - Update an item in QuickBooks. Payment Create Payment - Create a payment in QuickBooks. Update Payment - Update a payment in QuickBooks. Others HTTP Request - Make HTTP API calls to any QuickBooks documented REST APIs. Setup Overview linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in QuickBooks Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}