{
    "url": "https://docs.gocobalt.io/resources/integration-providers/deel",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Deel Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel Setup DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Deel Setup Connect to your Deel app for OAuth. Cobalt offers both Key Based and OAuth 2.0 integration for Deel. In this guide, we will look at the OAuth App setup process. To setup your Deel app in Cobalt for OAuth, you will need the following credentials from your Deel Developer Center : Client ID Client Secret Scopes ​ Pre-requisites Deel Developer account. You can create one here . ​ Required Settings Mandatory Scopes Users:read If you haven’t already created an app in Deel, you’d need to create one. ​ Creating an app in Deel To create a Deel app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Deel Developer Center . Go to App Store in the side menu > Click on Developer Center in the top right > Go to Apps tab. Click on Create New App button. Go to your Apps catalog in Cobalt > Search for Deel > Settings > Use your credentials > Callback Url > Copy it. In the app, choose App Type as Organization , enter the App Name and Description , paste the Callback Url under Redirect URL , provide an App Icon and click Create . Copy the Key (Client ID) and Secret (Client Secret) displayed on the screen. Copy the Client ID and Secret as it will not be visible again. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Deel actions and triggers. Following are the set of Deel actions and triggers supported by Cobalt. Actions Triggers Adjustments Create Invoice adjustment - Create an invoice adjustment in Deel. Update Invoice adjustment - Update an invoice adjustment in Deel. Get Adjustment by ID - Get an adjustment by ID in Deel. Timesheets Create timesheet - Create a timesheet in Deel. Update timesheet - Update a timesheet in Deel. Review a timesheet - Review a timesheet in Deel. Others HTTP Request - Make HTTP API calls to any Deel documented REST APIs. Connect Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Deel Configuring credentials in Cobalt Actions and triggers"
}