{
    "url": "https://docs.gocobalt.io/resources/integration-providers/snowflake",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Snowflake Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake Connect SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Snowflake Connect Connect with the Linked Account’s Snowflake account. Snowflake is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Snowflake integration, a Linked Account or an end-user will need to provide the following to connect: Private Key Passphrase Username Account Identifier To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Snowflake To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Snowflake account , click on your profile in the bottom left and under Account click on Copy Account Identifier . This is your Account Identifier which you need for authentication. Click on the My Profile option in the bottom left and copy the Username given. Open Terminal/Bash in your laptop(Linux/Mac/Windows) and type the following command: Command openssl genrsa 2048 | openssl pkcs8 -topk8 -inform PEM -out private_key.p8 -scrypt You will be prompted to provide Encryption Password . Provide a password, verify it and save it with you. This is your Passphrase for authentication. This Generates a file called private_key.p8 in the current directory. Open your private_key.p8 file in the terminal by using the following command and save it. This is your Private Key . Command cat private_key.p8 Generate Public Key using your passphrase from the 4th step by using the following command: Command openssl rsa -in private_key.p8 -pubout -out public_key.pem -passin pass: < your_passphrase > Open your public_key.pem file that was generated in last step using the command: Command cat public_key.pem Copy the Public Key displayed in your terminal. Go to Snowflake and click on your profile in the bottom left. Check if your current role is ACCOUNTADMIN or not under Switch Role . If not, switch role to ACCOUNTADMIN. ACCOUNTADMIN Role is necessary, otherwise you won’t be able to assign public key to user in the next step. In Snowflake click on Worksheets under Projects in the side menu. Click on + icon to create a new worksheet. Run the following statement in your worksheet by replacing the Username and Public_key with your own credentials. Statement ALTER USER <Username> SET RSA_PUBLIC_KEY=\"<Public_key>\" The Linked Account or end-user now have all the credentials required to connect with Snowflake. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Snowflake actions and triggers. Following are the set of Snowflake actions and triggers supported by Cobalt. Actions Triggers Statements Create Statement - Create a SQL statement in Snowflake. Get Statement - Retrieve the result of a SQL statement execution in Snowflake. Cancel Statement - Cancel an ongoing SQL statement in Snowflake. Others HTTP Request - Make HTTP API calls to any Snowflake documented REST APIs. Building a Slack integration Setup linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Snowflake Actions and triggers"
}