{
    "url": "https://docs.gocobalt.io/resources/integration-providers/zoho",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Zoho CRM Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Setup Zoom Zoho CRM Setup Connect to your Zoho CRM app for OAuth. To setup your Zoho CRM app in Cobalt for OAuth, you will need the following credentials from your Zoho Developer Console : Client ID Client Secret ​ Pre-requisites Zoho Developer Console. You can create one here . ​ Required Settings Mandatory Scopes ZohoCRM.users.READ ZohoCRM.notifications.CREATE ZohoCRM.notifications.DELETE If you haven’t already created an app in Zoho CRM, you’d need to create one. ​ Creating an app in Zoho CRM To create a Zoho CRM app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Zoho Developer Console . Click on the + Add Client button in the right and select Server-based Applications button. Enter the Client Name for your application and add a Homepage URL . Go to your Apps catalog in Cobalt > Search for Zoho > Settings > Use your credentials > Callback Url > Copy it. Paste the Callback URL under Authorized Redirect URIs and click on the Create button. Navigate to the Client Secret tab in the app and copy the Client ID and Client Secret . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth2 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, the app will now request for access of the mentioned scopes. If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Zoho CRM actions and triggers. Following are the set of Zoho CRM actions and triggers supported by Cobalt. Actions Triggers Account Create Account - Create an account in Zoho CRM. Update Account - Update an account in Zoho CRM. Upsert Account - Upsert an account in Zoho CRM. Delete Account - Delete an account in Zoho CRM. Contact Create Contact - Create a contact in Zoho CRM. Update Contact - Update a contact in Zoho CRM. Upsert Contact - Upsert a contact in Zoho CRM. Delete Contact - Delete a contact in Zoho CRM. Deal Create Deal - Create a deal in Zoho CRM. Update Deal - Update a deal in Zoho CRM. Upsert Deal - Upsert a deal in Zoho CRM. Delete Deal - Delete a deal in Zoho CRM. Lead Create Lead - Create a lead in Zoho CRM. Update Lead - Update a lead in Zoho CRM. Upsert Lead - Upsert a lead in Zoho CRM. Delete Lead - Delete a lead in Zoho CRM. Note Create Note - Create a note in Zoho CRM. Update Note - Update a note in Zoho CRM. Delete Note - Delete a note in Zoho CRM. Task Create Task - Create a task in Zoho CRM. Update Task - Update a task in Zoho CRM. Delete Task - Delete a task in Zoho CRM. Others HTTP Request - Make HTTP API calls to any Zoho CRM documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Zoho CRM Configuring credentials in Cobalt Configuring Scopes Actions and triggers"
}