{
    "url": "https://docs.gocobalt.io/resources/integration-providers/etsy",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Etsy Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Setup Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Etsy Setup Connect to your Etsy app for OAuth. To setup your Etsy app in Cobalt for OAuth, you will need the following credentials from your Etsy Developer account : Keystring Shared Secret ​ Pre-requisites Etsy Developer account. You can create one here . ​ Required Settings Mandatory Scopes listings_r listings_d listings_w Transactions_r If you haven’t already created an app in Etsy, you’d need to create one. ​ Creating an app in Etsy To create a Etsy app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Etsy Developer account . Click on the Manage your Apps icon in the side menu and click Create a New App button. Enter the App Name , Description , Website URL and other details and click on Read Terms and Create App button. Copy the Keystring (Client ID) and Shared Secret (Client Secret) displayed. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Configuring Scopes Cobalt lets you configure what permissions to ask from your users while they install your application. The scopes can be added or removed from the App settings page, under Permissions & Scopes section. For some applications Cobalt sets mandatory scopes which cannot be removed. Additional scopes can be selected from the drop down. Cobalt also has the provision to add any custom scopes supported by the respective platform. Once the scopes has been added to the application in Cobalt, the app will now request for access of the mentioned scopes. If you are facing scopes missing or invalid scope error. Make sure you are not passing any custom scope not supported by the platform. ​ App Approval for Etsy Once the app is created in Etsy, it needs to be approved by the Etsy team before it can be used for OAuth. If the keys are not approved in 3-4 Business days, you can contact the Etsy Developer team at developers@etsy.com describing your use-case , App name and the Keystring of the App to be approved. The app will be approved for Personal Access and since the app is only going to be used by a handful of Etsy members, then Commercial Access may not be required. Instead, these members can be added on as provisional users. Learn how to add provisional users to your app here . ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Etsy actions and triggers. Following are the set of Etsy actions and triggers supported by Cobalt. Actions Triggers Listings Get Listing by Shop -Get listing by shop in Etsy. Create Draft Listing - Create a listing for a Shop in Etsy. Delete Listing - Deletes a listing in Etsy. Update Listing - Update listing in Etsy. Payments Get payments - Get Payments of a shop in Etsy. Get shop payment by receipt ID - Get payment by receipt ID in Etsy. Others HTTP Request - Make HTTP API calls to any Etsy documented REST APIs. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in Etsy Configuring credentials in Cobalt Configuring Scopes App Approval for Etsy Actions and triggers"
}