{
    "url": "https://docs.gocobalt.io/resources/integration-providers/twilio",
    "text": "Connect - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Twilio Connect Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Connect Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Twilio Connect Connect with the Linked Account’s Twilio account. Twilio is an API Key based integration and does not require the setup of an app. ​ Required Credentials of a Linked Account To successfully connect with the Twilio integration, a Linked Account or an end-user will need to provide the following to connect: Auth Token Account SID To understand how a Linked Account can get the above mentioned credentials, refer below. ​ Getting Credentials of Trello To acquire the required credentials and connect a Linked Account, please follow the steps mentioned below: Log in to your Twilio account . In the home page, complete the first step to enable your Account SID and Auth token . Under Account Info , you will find the Account SID and the Auth Token . The Linked Account or end-user now have all the credentials required to connect with Twilio. ​ Actions and triggers In Cobalt, you can create orchestrations of your use-cases using Twilio actions and triggers. Following are the set of Twilio actions and triggers supported by Cobalt. Actions Triggers Messages Create Message - Create a new message in Twilio. Get Message by ID - Get a message by ID in Twilio. List Messages - List all messages in Twilio. Update Message - Update a message in Twilio. Delete Message - Delete a message in Twilio. Calls Create Call - Create a call in Twilio. List calls - List all calls in Twilio. Get Call by ID - Get a call by ID in Twilio. Others HTTP Request - Make HTTP API calls to any Twilio documented REST APIs. Connect Connect linkedin twitter Powered by Mintlify On this page Required Credentials of a Linked Account Getting Credentials of Trello Actions and triggers"
}