{
    "url": "https://docs.gocobalt.io/resources/integration-providers/exactonline",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Exact Online Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Setup Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom Exact Online Setup Connect to your Exact Online app for OAuth. To setup your Exact Online app in Cobalt for OAuth, you will need the following credentials from your Exact Online Developer account : Client ID Client Secret ​ Pre-requisites Exact Online Developer account. You can create one here . If you haven’t already created an app in Exact Online, you’d need to create one. ​ Creating an app in Exact Online To create a Exact Online app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your Exact Online Developer account . Click on Manage my apps in the top right corner. Click on Register a Production App or Testing App depending on your requirements. Go to your Apps catalog in Cobalt > Search for Exact Online > Settings > Use your credentials > Callback Url > Copy it. Enter the App Name , paste the Callback Url under Redirect URI and click Register . Go to the Develop your App section and copy the Client ID and Client Secret from Authorisation details . ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ App Review for Exact Online If you want external customers to use your app, then the OAuth app must be submitted for Review. To submit your app for a review, go to Manage my apps > Your Registered app > Submit for review . Learn more about the Exact Online App Review process here . ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using Exact Online actions and triggers. Following are the set of Exact Online actions and triggers supported by Cobalt. Actions Triggers GL Accounts Create GL Account - Create an account in Exact Online. Update GL Account - Update an account in Exact Online. Delete GL Account - Delete an account in Exact Online. Get all GL Accounts - Get all accounts in Exact Online. Sales Invoices Create Sales Invoice - Create an invoice in Exact Online. Delete SalesInvoice - Delete an invoice in Exact Online. Update Sales Invoice - Update an invoice in Exact Online. Get Sales Invoices - Update all sales invoices in Exact Online. Item Get Items - Get all items in Exact Online. Delete Item - Delete an item in Exact Online. Create Item - Create an item in Exact Online. Payments Get all Payments - Get all payments in Exact Online. Departments Get Departments - Get all departments in Exact Online. Others HTTP Request - Make HTTP API calls to any Exact Online documented REST APIs. Get Profile - Get the current user in Exact Online. Setup Setup linkedin twitter Powered by Mintlify On this page Pre-requisites Creating an app in Exact Online Configuring credentials in Cobalt App Review for Exact Online Actions and triggers"
}