{
    "url": "https://docs.gocobalt.io/resources/integration-providers/myob",
    "text": "Setup - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation MyOB Setup Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Resources Integration Providers Overview Adobe Sign Adobe Workfront Agile CRM Aircall Airtable Amazon S3 Apptivo Asana Attio AWS Security Hub Azure Security Center Basecamp BigCommerce Bitbucket Box Calendly Capsule CRM Chargify ClickUp Clover Confluence Constant Contact Contentful Copper Customer.io Deel DocuSign Dropbox Epic Etsy Exact Online Facebook Ads Figma Fireflies.ai FreeAgent FreshBooks FreshSales CRM Front GetResponse GitHub Gong Google Admin Google Drive Google Sheets Gusto Harvest Help Scout HiBob HighLevel Hubspot Intercom Jibble Jira Keap Keka HR Lever Mailchimp Marketo Miro Microsoft Office 365 Microsoft Defender Microsoft Dynamics CRM Microsoft OneDrive Microsoft Teams Monday MyOB Setup NetSuite Notion OpenText Outreach PagerDuty Pandle Pardot Pipedrive QuickBooks Salesforce Salesforce Financial Services Cloud Salesloft Sentry ServiceNow Shopify Slack Snowflake SurveyMonkey Tableau Talkdesk Teamwork Trello Twilio Workable Workday Wrike Xero Zendesk Sell Zettle Zoho Books Zoho CRM Zoom MyOB Setup Connect to your MyOB app for OAuth. To setup your MyOB app in Cobalt for OAuth, you will need the following credentials from your MyOB Developer account : Client ID Client Secret Scopes ​ Pre-requisites MyOB Developer account. You can request access here . ​ Required Settings Mandatory Scopes CompanyFile If you haven’t already created an app in MyOB, you’d need to create one. ​ Creating an app in MyOB To create a MyOB app and aquire the above mentioned credentials, please follow the steps mentioned below: Log in to your MyOB Developer account . Click on the Developer option in the top nav bar. Click on Register App button in the right. Go to your Apps catalog in Cobalt > Search for My OB > Settings > Use your credentials > Callback Url > Copy it. Enter the App Name for your application and paste the Callback Url under Redirect Uri and click on Register App button. In the Developer Dashboard , copy the Client ID under Key and Client Secret under the Secret field. ​ Configuring credentials in Cobalt App settings page lets you configure the authentication settings for an OAuth 2.0 based application. For your customers to provide you authorization to access their data, they would first need to install your application. This page lets you set up your application credentials. Cobalt lets you use pre-configured applications to play around. You can do so by selecting Use our credentials . However, if you wish to use your own application, select Use your own credentials . Provide the aquired Client Id and Client secret and save it. ​ Actions and triggers Once the above setup is completed, you can create orchestrations of your use-cases using MyOB actions. Following are the set of MyOB actions supported by Cobalt. Actions Triggers Bills Get Bills - Get all bills in MyOB. Item Create Item - Create an item in MyOB. Update Item - Update an item in MyOB. Delete Item - Delete an item in MyOB. Ledger Account Create Account - Create an account in MyOB. Update Account - Update an account in MyOB. Delete Account - Delete an account in MyOB. Get Accounts - Get all accounts in MyOB. Others HTTP Request - Make HTTP API calls to any MyOB documented REST APIs. Get Invoices - Get all invoices in MyOB. Setup Key Based Connect linkedin twitter Powered by Mintlify On this page Pre-requisites Required Settings Creating an app in MyOB Configuring credentials in Cobalt Actions and triggers"
}