{
    "url": "https://docs.gocobalt.io/ship/tryapi",
    "text": "Try API - Cobalt Cobalt home page v2 Search... Dashboard Contact Us Dashboard Search... Navigation Ship Integrations Try API Documentation Implementation & Guides API Reference SDKs Resources Cobalt home page v2 Postman Get Your API Key Examples Getting Started Introduction Quickstart Build Platform Setup Connectors Workflows Advanced Features Ship Integrations Auth Flows Try API Maintain Observability with Logs Reliability Custom App Custom App Setup Deployment Cobalt Deployment Hosting Solutions Governance & Compliance Security Application Security Compliance & Certifications Privacy Policy Term of Use Ship Integrations Try API More about the Try API Settings and how it can assist you to fire and test workflows in Cobalt. The Try API feature in Cobalt allows users to simulate event or workflow execution, providing a convenient way to test workflows and validate the behavior of associated actions. The Try API feature can be utilized in both Production and Test environments. Events selected through the Try API interface can serve as triggers within workflows. The payload associated with the selected event is loaded by default within the Try API interface and users can make necessary modifications to it before firing the event. Using Try API , you can simulate execution for workflows with Event based triggers or Workflows API triggers. ​ Pre-Condition Before utilizing the Try API feature, ensure that the Application is connected for the Linked Account and configured properly. Navigate to the Application for which you want to create and test a workflow. Create a workflow and add an Event or Workflow API depending on your use-case in the Start Node, along with associated actions. Publish the workflow to make it available for execution. Learn more about how to create workflows here . Enable the workflow for a Linked Account after making a successful connection through authenticating. ​ Execution To fire an event in the Try API section, follow these steps: Navigate to the Try API section in Cobalt. You will have 2 options to perform execution depending on the trigger added: Fire Event 1 Configure Select the Linked Account , choose the desired Event from the available options, specify the Application associated with the workflow. Optionally, select a Config ID if required. If an Application is not selected for Try API, then all the workflows in the associated Linked Account with the selected Event will be fired. 2 Fire Click on the Fire Event button in the top right. Execute Workflow API 1 Workflow tab Switch to the Workflow tab in the Try API. 2 Configure Select the Linked Account , choose the Workflow with Workflow API as trigger and specify the Application associated with it. Optionally, select a Config ID if required. Toggle on the Synchronous Execution toggle if required. 3 Execute Click on the Execute Workflow button in the top right. ​ Expected Result Upon firing or executing, it will be logged within the Cobalt system. You can check the logs by navigating to Logs section in Cobalt. Re-Authentication Observability with Logs linkedin twitter Powered by Mintlify On this page Pre-Condition Execution Expected Result"
}